{
    "version": "https://jsonfeed.org/version/1",
    "title": "Social Impact Guild",
    "description": "",
    "home_page_url": "https://blog.socialimpactguild.com",
    "feed_url": "https://blog.socialimpactguild.com/feed.json",
    "user_comment": "",
    "icon": "https://blog.socialimpactguild.com/media/website/logo-white-pink-bg-round-2.png",
    "author": {
        "name": "Nadia Humbert-Labeaumaz"
    },
    "items": [
        {
            "id": "https://blog.socialimpactguild.com/amintro.html",
            "url": "https://blog.socialimpactguild.com/amintro.html",
            "title": "Building a Sustainable Free Platform w/ Amintro",
            "summary": "<p>With Charlene Nadalin, Founder and CEO at Amintro, we talked about the reality of social isolation and uncovered insights into building a sustainable free platform to genuinely help people while generating enough revenues to sustain your purpose.</p>\n",
            "content_html": "<p>With Charlene Nadalin, Founder and CEO at Amintro, we talked about the reality of social isolation and uncovered insights into building a sustainable free platform to genuinely help people while generating enough revenues to sustain your purpose.</p>\n\n<h2>About Amintro</h2>\n<p>What started as a desire to help Amintro founder Charlene Nadalin's mother became a concrete initiative to foster friendship among people over 50 in North America.</p>\n<p>Amintro from Latin <em>amica - introduction</em> (literally <em>friends</em> - <em>introduction</em>) provides baby boomers and seniors with a free platform to let them find a group of friends with which they can share time and experiences to avoid loneliness and social isolation. It also features relevant editorial content about how to live healthier and happier.</p>\n<p>\"The reality is that social isolation and loneliness is a global epidemic,\" Charlene says. Amintro envisions becoming a global brand and solution to help seniors and their families.</p>\n<p>To support Amintro, Charlene underlines you can spread the word about their social platform to create more opportunities for people to connect and contact them if you want to become part of the solution.</p>\n<h2>Insights Into Building a Sustainable Free Platform</h2>\n<p>You can stay true to your values and develop an inclusive and sustainable business without having to opt for a freemium model.</p>\n<p>To do so, you need to define <strong>one </strong>revenue model and roll it out to develop and test your platform, Charlene shares. The idea is to understand the relevance of other potential revenue models and discover new revenue streams along the way. She highlights that you can only do so once you have built your product.</p>\n<p><strong>So,</strong> <strong>how to develop a relevant and robust first revenue model?</strong></p>\n<p>If possible, leverage your previous experiences and professional network to define the clientele that will help you keep the platform free.</p>\n<p>Charlene used her extensive marketing and editorial sales experience to develop partnerships with organisations that sponsor the content in her platform, helping her sustain Amintro. \"You need to know your clientele, understand their needs and pain points. [I realised that] I had a network of past clients who may benefit from what we are doing at Amintro,\" she explains.</p>\n<p>Amintro's partners include financial institutions, insurance companies, travel agencies, food manufacturers, among others, that provide services and products to support her target demographic. Note that these partnerships are also <strong>aligned</strong> with the company's purpose as they allow giving seniors access to valuable information for their mental and physical well-being.</p>\n<p>In terms of marketing, your positioning can significantly differ between your clientele and the people you want to support.</p>\n<p>To scale up your purpose and increase your impact, it might be necessary to consider fundraising. \"We have identified other opportunities for our stakeholders that will generate revenue, and we are [, therefore,] going into fundraising to build out our intellectual property and technology\".</p>\n<p>During the whole process, do not hesitate to look out for help in the areas that you do not know well, use the available resources, and build relationships with people who share your values.</p>\n<h2>Inspiration to Go!</h2>\n<blockquote>\n<p>I have learned through all of this that people want to see you succeed and are generous with their knowledge and experience. They are very much willing and happy to answer your questions or to provide some form of assistance, whatever that may be. That is not something that I realised before starting the company.</p>\n</blockquote>\n<hr>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn.</a> I am looking forward to it!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/15/hero-friends.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-04-25T12:20:19-04:00",
            "date_modified": "2021-04-28T08:35:38-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/a-friendlier-company.html",
            "url": "https://blog.socialimpactguild.com/a-friendlier-company.html",
            "title": "Kick-Starting a Social Venture w/ A Friendlier Company",
            "summary": "<p>With Kayli Dale, Co-founder and CEO at A Friendlier Company, we discussed how to make reuse accessible and uncovered insights into kick-starting your own (social) venture.</p>\n",
            "content_html": "<p>With Kayli Dale, Co-founder and CEO at A Friendlier Company, we discussed how to make reuse accessible and uncovered insights into kick-starting your own (social) venture.</p>\n\n<h2>About A Friendlier Company</h2>\n<p>After graduating from the University of Waterloo, Kayli Dale and Jacqueline Hutchings founded A Friendlier Company to simplify reuse and make it \"as convenient and accessible to everybody as possible\".<br><br>It all started during their co-op experiences abroad, which exposed them to sustainable practices and circular packaging systems they had not seen yet in Canada. These eye-opening experiences, notably in the Scandinavian countries, inspired them to use reverse logistics to create \"a solid process that would enable the reuse of packaging\".<br><br>Launched less than six months ago, amid the pandemic, A Friendlier Company has already rapidly expanded to support several Ontarian areas thanks to the support of the people who have \"rallied behind the foodservice businesses in [their] program,\" she says. As a result, Kayli explains they have reused \"over 5,000 containers that are equivalent to diverting 600 pounds of waste from landfill\". <br><br>For the years to come, they keep in mind that they want to \"create a system for the average consumer and not just people who are [interested] in sustainability\" to broaden their impact. So, they envision further expansion across Ontario to reach more people.<br><br>To support them, you can ask your favourite restaurants and takeout places for reusables! You can also join their social media platforms and download their app to find locations using their system readily.</p>\n<h2>Insights into Kick-Starting a Social Venture</h2>\n<h3>Finding the Idea</h3>\n<p>\"Find a problem that you are passionate about. It is not an easy journey! If you do not feel incredibly passionate about what you are doing, and if it does not give you the motivation to keep going, it is going to be tough.\", Kayli underlines.</p>\n<p>The idea is to make sure to \"choose a problem that<strong> needs </strong>solving,\" and you are willing to put the effort in to solve it.</p>\n<h3>First Steps</h3>\n<p>It is crucial always to be adaptable and <strong>resilient</strong>. A Friendlier Company faced two major obstacles at the beginning:</p>\n<ul>\n<li><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">Being constantly <strong>rejected</strong>; and</span></li>\n<li>Targeting large event venues and having to deal with COVID-19 (e.g. large unsold inventory).</li>\n</ul>\n<p>However, they <strong>adjusted quickly </strong>to the changes taking place in the market and \"built a system that would work during the pandemic\" and would tackle the ongoing increase in takeout waste. They also adopted an iterative and focused approach that helped them move forward.</p>\n<p>Moreover, Kayli highlights that \"every piece of [their] process was a big undertaking,\" and they leveraged their previous exposure to the startup world and experiences to design this process. According to her, other essential factors to the company's success include:</p>\n<ul>\n<li>Applying to various programs;</li>\n<li><strong>Networking </strong>with as many people as possible; and</li>\n<li>Being willing to change your mind about your ideas.</li>\n</ul>\n<h3>Scaling-up</h3>\n<p>Raising equity enables growth and scaling up quickly to make a significant impact. A Friendlier Company won funding through programs first, then small equity fundraising and now they are contemplating opening up their pre-seed.</p>\n<p>They also work with a few groups from various universities (from engineering to marketing) and are hiring co-ops students to give back to the programs that initially helped them. Also, they look for people who \"<strong>understand the problem</strong> <strong>they are trying to address and</strong> <strong>feel passionate about solving it</strong>\" through conferences and networking events, for instance.</p>\n<h2><strong>Inspiration to Go!</strong></h2>\n<blockquote>\n<p>There are so many important problems out there that are not getting enough attention, especially in the social impact area.</p>\n<p>Those areas can still be profitable, and they need businesses and smart people to come in, work on those problems and build up those markets. It is an extremely fun and exciting journey, and I do not think you will regret it!</p>\n</blockquote>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-1-2.jpg\" data-size=\"1080x1080\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-1-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-9-2.jpg\" data-size=\"1080x1080\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-9-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-3-2.jpg\" data-size=\"1080x1080\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-3-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/14/gallery/phot-8-2.jpg\" data-size=\"1080x1163\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/14/gallery/phot-8-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"775\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-11-2.jpg\" data-size=\"899x1122\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-11-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"899\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-7-2.jpg\" data-size=\"1080x1350\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/14/gallery/photo-7-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"900\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn.</a> I am looking forward to it!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/14/header.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-04-24T21:27:04-04:00",
            "date_modified": "2021-04-29T07:29:02-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/pow-hearing.html",
            "url": "https://blog.socialimpactguild.com/pow-hearing.html",
            "title": "Adapting to a New Macro Environment w/ POW Hearing",
            "summary": "<p>With Laura Mather, Owner and Director at POW Hearing Solutions, we talked about supporting people with hearing loss and uncovered insights into adapting to the current macro shock.</p>\n",
            "content_html": "<p>With Laura Mather, Owner and Director at POW Hearing Solutions, we talked about supporting people with hearing loss and uncovered insights into adapting to the current macro shock.</p>\n\n<h2>About POW Hearing</h2>\n<p>Laura lost 25% of her hearing due to a noisy work environment, and it kept progressing over time. She explains that, for most people, \"it takes 7 to 12 years to start to move forward on helping yourself to hear better.\" Indeed, transitioning to their new situation takes a process that includes dealing with denial and finding a motivation to move forward.</p>\n<h3>Hearing Loss Can Affect Us All</h3>\n<p>Hearing loss can affect anyone, even people who do not go to a loud concert or experience a speaker's or an instrument's feedback, Laura says. Indeed, \"an extended sound exposure above 80 dB can [also] be harmful to your hearing\". <br>Also, she warns against prescribed and over-the-counter medication that can be ototoxic. \"In some cases, it can damage your hearing permanently.\" <br><br>People like Laura, who lose their hearing progressively, \"might gradually withdraw from situations that put [them] at a disadvantage\", without necessarily realising it. Often, \"[they] will pick up other ways of doing things [and] work around it\".</p>\n<h3>POW Hearing's Origin</h3>\n<p>During her post-secondary studies, Laura experienced first-hand the difficulties of following an event and interacting with a group of people in real time with impaired hearing. She had to put several systems in place to capture the ongoing events and conversations.</p>\n<p>After graduation, discrimination prevented Laura from working properly. It made her realise she could start her own business to support her community.</p>\n<p>She has, therefore, built upon the knowledge she acquired during her studies and life experiences to offer multiple fit-for-purpose easy-to-use devices and services related to hearing loss. \"If a business gets a request by somebody working with them to accommodate that person, to hear well at a live event with a large audience, for example, then they will come to [POW Hearing] to set that up for them.\" As a result, \"people feel respected and cared for\". </p>\n<p>Laura is currently looking for funds and support with marketing. In the future, she is hoping that existing players in the hearing loss space will join her in her journey to help people in different situations.</p>\n<h2>Insights Into Adapting to a New Macro Environment</h2>\n<p>With COVID, Laura had to reinvent herself as she could no longer offer her services during events. </p>\n<p>The key to adapting to a new macro context is to leverage your strengths vis-a-vis competition and rearrange your capabilities to avoid <strong>strategic drift</strong>. Usually, this drift occurs over a few years. A macro shock accelerates this phenomenon, and companies might have to adapt overnight. </p>\n<p>Laura probably saved her business by offering \"<span class=\"lt-line-clamp__raw-line\"><a href=\"https://powhearing.com/\" target=\"_blank\" rel=\"noopener\">clear window lip reader face masks</a>\" to foster accessible communication and adapt to her new situation. </span></p>\n<p><span class=\"lt-line-clamp__raw-line\">Interestingly, these masks also have the side effect of enabling human interactions and facilitate communication, even for people with perfect hearing - which further increase the relevance of her solution.</span></p>\n<blockquote>\n<p>A lot of people are lowering their masks. This is negating every safety features put in place! If I am crossing the street, wearing this mask, I have people stop me and say, where did you get that?</p>\n</blockquote>\n<h2>Inspiration to Go!</h2>\n<p>For someone who has hearing loss, Laura highlights that one size does not fit all. You can start by asking them what they need. \"I can give you a list, but it is not going to work,\" she says.</p>\n<p>Overall, if you look at how people can communicate with you, you should offer a way that does not involve them to hear. For instance, an email address instead of a phone number only.</p>\n<blockquote>\n<p>People who have hearing loss can do everything that people who do not have hearing loss can do, except they cannot hear!</p>\n</blockquote>\n<hr>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn.</a> I am looking forward to it!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/16/photo.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-03-24T18:50:00-04:00",
            "date_modified": "2021-04-28T17:07:04-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/oacc.html",
            "url": "https://blog.socialimpactguild.com/oacc.html",
            "title": "Putting People at the Centre of Design w/ OACC",
            "summary": "<p>With Marveh Farhoodi, Program Director at the Open Architecture Collaborative Canada (OACC), we uncovered insights into leveraging human-centred design for architectural and community projects.</p>\n",
            "content_html": "<p>With Marveh Farhoodi, Program Director at the Open Architecture Collaborative Canada (OACC), we uncovered insights into leveraging human-centred design for architectural and community projects.</p>\n\n<h2>About Open Architecture Collaborative Canada</h2>\n<p>OACC is a collaborative of socially-minded people with the mission to advocate for positive changes in the building of under-served communities' neighbourhoods in the Greater Toronto Area.</p>\n<p>For instance, OACC organised a community session to revisit the planning of a neighbourhood that was heavily impacted by gentrification. A motion has then been started to ensure that this neighbourhood's cultural identity will be preserved in the community.</p>\n<p>For the past one-and-a-half year, OACC have been transitioning from an exclusively volunteer-run organisation and project-based mindset to a mission-centric startup. In a couple of years, they are hoping to be a social hub to incubate ideas for more resilient cities and neighbourhoods in Canada.<br><br><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">OACC always welcome volunteers that are aligned with their purpose. They are also looking for funding and sponsoring. Finally, if you are interested in learning about what they do through their workshops, they would be more than happy to provide that service to you.</span></p>\n<h2>Insights Into Human-Centred Design</h2>\n<p>The human-centred design is an approach that OACC uses to understand social challenges. It is already commonly used in various industries, but not yet in this space.</p>\n<p>It tries to come to a collective solution by engaging with the people it will serve to understand their needs properly. They should be at the centre of creating and not just providing inputs.</p>\n<h3>The Five Steps of the Human-Centred Design</h3>\n<p>The human-centred design process contains five steps: Framing, Empathising, Synthesising, Concepting and Prototyping.</p>\n<figure class=\"post__image align-center\"><img loading=\"lazy\"  src=\"https://blog.socialimpactguild.com/media/posts/17/hcd.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://blog.socialimpactguild.com/media/posts/17/responsive/hcd-xs.png 300w ,https://blog.socialimpactguild.com/media/posts/17/responsive/hcd-sm.png 480w ,https://blog.socialimpactguild.com/media/posts/17/responsive/hcd-md.png 768w\"  alt=\"\" width=\"752\" height=\"278\"></figure>\n<p>The two first steps are those involving primary and secondary data collection.</p>\n<ul>\n<li><strong>Framing</strong> is about understanding the team's capacity based on the available resources as well as defining assets, budget and time. This step's inputs include the project's broad definition and secondary data.</li>\n<li><strong>Empathising</strong> is about collecting primary data and further learning from your context.</li>\n</ul>\n<h3>Collecting Data</h3>\n<p>To collect primary data, OACC uses one-on-one or small group interviews, while putting co-creation at the centre of their research. For instance, they organise community meetings and workshops to envision what they want to work on visually and creatively. These interactions provide insights into people's point of view and desires.</p>\n<p>OACC also uses surveys, focus groups, and collaboration between focus and research groups to go further.</p>\n<p>In summary, they leverage diverse techniques and tools based on live interactions between local stakeholders and specialists.</p>\n<h2>Inspiration to Go!</h2>\n<blockquote>\n<p>What we do can create momentum for changes. These small interventions let communities share their ideas for their neighbourhoods and create collaborative momentum for more systemic changes, creating a more equitable quality of public spaces.</p>\n</blockquote>\n<p> </p>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-1.jpg\" data-size=\"800x473\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-1-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"426\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-2.jpg\" data-size=\"945x756\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-3.jpg\" data-size=\"2048x1363\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-3-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"479\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-4.jpg\" data-size=\"2048x1363\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-4-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"479\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-5.jpg\" data-size=\"504x378\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-5-thumbnail.jpg\" alt=\"\" width=\"504\" height=\"378\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-6.jpg\" data-size=\"1080x809\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/17/gallery/image-6-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"539\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn.</a> I am looking forward to it!</p>\n<p> </p>",
            "image": "https://blog.socialimpactguild.com/media/posts/17/image-6-2.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-02-27T21:01:00-05:00",
            "date_modified": "2021-04-27T21:34:23-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/y-ultimate.html",
            "url": "https://blog.socialimpactguild.com/y-ultimate.html",
            "title": "Lift Your Spirit With Y-Ultimate!",
            "summary": "<p>Sports are often used as a tool for personal and social development. They can instil a multitude of values, then reflected throughout our lives. I met with Benoy Stephen and Vivek Srivastava to talk about how they are using Ultimate Frisbee to support children from economically and socially disadvantaged communities in India. If you want to learn more about this sport and the effects it has had on these children, check out this interview!</p>\n",
            "content_html": "<p>Sports are often used as a tool for personal and social development. They can instil a multitude of values, then reflected throughout our lives. I met with Benoy Stephen and Vivek Srivastava to talk about how they are using Ultimate Frisbee to support children from economically and socially disadvantaged communities in India. If you want to learn more about this sport and the effects it has had on these children, check out this interview!</p>\n<hr>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/cw8UZrG1rcw\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><strong>Can you tell me about yourself and your organisation?</strong> </p>\n<p><em>Benoy</em>: Hi, Nadia, thanks a lot for having us here! My name is <a href=\"https://www.linkedin.com/in/benoy-stephen/\" target=\"_blank\" rel=\"noopener noreferrer\">Benoy Stephen</a>, and I play the sport called Ultimate Frisbee. I got introduced to the sport during my last undergrad year. Then, I got the chance to work with <a href=\"https://www.teachforindia.org/\" target=\"_blank\" rel=\"noopener\">Teach for India</a> for two years in a government school in Hyderabad, where we met with some wonderful kids and tried out a few things to support them using Ultimate Frisbee as a tool. In the process, I met <a href=\"https://www.linkedin.com/in/vivekanand-srivastava-13b78751/\" target=\"_blank\" rel=\"noopener\">Vivek Srivastava</a> and a few other peers who also had a passion for Ultimate Frisbee and wanted to help children through this sport. So, we all set up Y-Ultimate together and now, here we are.</p>\n<p><em>Vivek</em>: I used to sail on ships for 15 years before deciding that I wanted to do something else and went into business school. During my studies, I loved learning about Organisational Behaviour and became a research assistant in the field. One of my research's topics was ethics at the workplace, and that is how I came across Ultimate Frisbee. Then, I completely went into the sport and started playing full time.</p>\n<p>We are both members of our team and play with our kids. The youngest in our team is 15 years old, and the oldest is me, and I am over 40. We all work hard together!</p>\n<blockquote>\n<p>At the end of every Ultimate Frisbee game, a spirit circle takes place. It is a beautiful concept where you have both team members mixing up, coming together in a circle, and then resolving any conflict, giving feedback, appreciating each other so that everyone goes home with a clean slate.</p>\n</blockquote>\n<p><strong>What is Ultimate Frisbee?</strong></p>\n<p><em>Vivek</em>: Ultimate Frisbee is a non-contact self-refereed mixed-gender sport. It is played with a flying disc, and you could say it is a mixture of basketball and American football.</p>\n<p>Unlike many sports, you have to self-officiate and uphold the rules as a result. This constitutes the fundamental principle on which Ultimate runs, and it is called the spirit of the game (SOTG). You do not use any mind games and always have to remain respectful while playing. </p>\n<p>Ultimate Frisbee is not that well-known in India (we have about 10,000 people playing), but we use it as a tool for kids' development.</p>\n<p><em>Benoy</em>: Also, at the end of every Ultimate Frisbee game, a spirit circle takes place. It is a beautiful concept where you have both team members mixing up, coming together in a circle, and then resolving any conflict, giving feedback, appreciating each other so that everyone goes home with a clean slate. It is a space for reflection built into the sport that constitutes an excellent tool for learning. </p>\n<blockquote>\n<p>Over time, the main drivers that we had were the changes that we saw in those kids' lives and the results that we noticed in the field.</p>\n</blockquote>\n<p><strong>What were your drivers and motivations to start the organisation?</strong></p>\n<p><em>Vivek: </em>In the heart of Delhi, we came across a small community that was economically challenged. The children from this community would come, watch us play and become enthusiastic about it. They wanted to play, and we pulled them in with us. We quickly saw their potential: they were very athletic and picked up the sport very fast. They were exceptional! We started to ask ourselves how we could help them to let them play more. Indeed, no support is available for this sport in India, and you need shoes, gear and money to play in tournaments.</p>\n<p>In 2015, we started to help a small group of kids from that community (between 10 to 15 years old), and they just kept getting better. We were encouraged by how they were growing, so we did not want to remove our financial support. However, we thought that we needed to develop further this project to sustain it.</p>\n<p>We got donations from family and friends as a first step. Then, inspired by the positive changes that we saw in these children, we thought about registering ourselves as an organisation to support even more children in India. All along, our biggest motivation has been those kids.</p>\n<p><em>Benoy: </em>We did not start off thinking that we wanted to become an organisation but rather as a group of friends who met on the Ultimate Frisbee field and thought about supporting the children who were playing and could play the sport. Over time, the main drivers that we had were the changes that we saw in those kids' lives and the results that we noticed in the field.</p>\n<p><strong>How do you reach out to more children? Do you have partnerships with schools or, do you use other channels?</strong><br><br><em>Benoy</em>: The young kids that we met in Delhi have grown so much as players and individuals. So, we decided to mentor them into becoming our young coaches to help us reach out to more children.</p>\n<p>We have three models to do so. One is through schools: we have both an in-school program and an after-school program - depending on what works best for each school. We also do a community program where we immerse ourselves in a community with the support of a partner organisation and other groups or individuals. Finally, we help other organisations set up their Ultimate Frisbee program, where our youth coaches go, build capacity, and then leave and support them remotely. <br><br><strong>You mentioned you needed funds to pay for the gear and tournaments, for instance. Do you generate revenues to sustain your purpose?</strong><br><br><em>Benoy</em>: Most of our revenue comes from donations, and we have individuals who donate to us for a particular community. So, whatever contribution we get goes entirely to the youth coach that is handling that community.</p>\n<blockquote>\n<p>Many communities want engagement for recreational purposes, but also some communities start aspiring to take the sport more seriously. We are always happy to support them no matter how far they want to go.</p>\n</blockquote>\n<p><strong>How long do you work with a certain group of children?</strong><br><br><em>Benoy</em>: The kids we met in Delhi always stay with us and have become our youth coaches, and we plan to stay together. Otherwise, we conduct one-time workshops in communities and schools and continuous coaching programs that last a year or more - depending on the funding, players' availability, community issues, and more.<br><br><em>Vivek</em>: Yes, the youth coaches constitute an essential part of our organisation, and we are all able to teach people right from the beginning (basic level and up). So, it will just depend on the aspirational level of the children. Many communities and NGOs want engagement for recreational purposes, but also some communities start aspiring to take the sport more seriously. We are always happy to support them no matter how far they want to go.</p>\n<p><strong>It is great to hear about what you have been doing as you are working with children from economically disadvantaged communities and providing them with a sense of community and purpose. I think you are fostering many social and emotional skills such as collaboration, inclusiveness, humility, responsibility and resilience among these children!</strong></p>\n<p><em>Vivek</em>: Yes, and you know, our children regularly get selected for the Indian national team. Two of our girls have already represented India at an international level. In 2020, we had four of our girls who got selected for an Under-20 (U20) team for India. Unfortunately, the tournament got cancelled because of COVID-19, but that is how good our children are. I also got the chance to play a tournament in France while representing India, and we won the Spirit of the Game Award.<br><br><strong>That is awesome, congratulations guys! I saw you have been to several states in India. So, how many children have you worked with so far?</strong><br><br><em>Benoy:</em>  We have worked with more than 1200 children in one year so far.</p>\n<blockquote>\n<p>One of our girls wants to grow up to implement policy changes to allow for more gender equality and tackle other issues that she has seen in her village. Others want to become lawyers.</p>\n</blockquote>\n<p><strong>Overall, what effects have you seen in their lives as a result of your initiatives?</strong><br><br><em>Vivek</em>: The community in Delhi, previously mentioned, has around 500 children, and we work with 30 of them. So, if you look at their peers, they tend to drop out of school as they do not have the correct support system to help them make the right decisions for their future.</p>\n<p>On the other hand, most of our team's children are doing well in school and have future goals. For instance, one of our girls wants to grow up to implement policy changes to allow for more gender equality and tackle other issues that she has seen in her village. Others want to become lawyers.</p>\n<p>All of this has been very organic - and we think it is related to the nature of the sport. Indeed, Ultimate is an inclusive sport where both genders play together. So, all of our kids have forgotten gender stereotypes. Also, they do not pick up on their peers' bad habits such as smoking and drinking as it is not enough to be gifted to succeed in this sport - you have to put in the effort and discipline to get results.</p>\n<p>So, we have noticed changes in their attitudes such as resilience, discipline, ownership, positivism and inclusiveness; and it is so nice to see what they are now doing with their lives. These changes have kept us going.</p>\n<p><strong>Sports are so powerful. In this case, it is fantastic to see the wide range of effects that it has had in these children's lives. It is also great to hear that they have started to pay more attention to their health to get better at the sport.</strong></p>\n<p><em>Vivek</em>: Yes! One of our kids stopped smoking because he realised that it was vital if he wanted to improve. He just came to that conclusion himself and stopped smoking!</p>\n<p><strong>Let's talk more about your journey to become an organisation. Was there anything crucial to make it happen?</strong><br><br><em>Benoy</em>: I would say something crucial was constantly seeing our team winning tournaments and the Spirit of the Game Award, calculated based on opponents' rates. So, playing at the highest level of spirit and winning as a result of performing at our best were components that made us keep moving forward. </p>\n<p><strong>What have been your biggest challenges?</strong><br><br><em>Benoy: </em>Even though the International Olympic Committee recognised the sport, our country does not recognise it. So, when you pitch the sport in a school or community, you get asked questions as \"Can I make a career out of this?\" \"Will I get a certificate that is going to help me with a job or an admission somewhere?\" Sadly, the answer to those questions is \"not yet\". So, we have to let them see the potential the sport has and ask them to give us a chance to show them.<br><br><em>Vivek</em>: Another challenge is funding to take care of our coaches, the costs of travel, the gear and other expenses. We also need to cover the financial incentives we have in place for our kids who teach and coach other children via our paid-forward model. In this model, we try to cross-subsidise our initiatives. For instance, we take the money earned from going to a school, which generally can pay us a session and use it to work with socially and economically underprivileged communities. However, as schools do not know well about Ultimate and it is not a well-recognised sport in India, it becomes challenging to sustain our model.</p>\n<p><strong>What effects has the pandemic had on your work, and how have you adapted so far?</strong><br><br><em>Vivek</em>: We have not been able to play since March last year. Meanwhile, we have expanded our team and reached out to people who can help us market ourselves and translate what we are trying to say in better ways. They do not play, but they believe in what we are doing. We will see their work's effects when everything reopens.</p>\n<p>Otherwise, we have been doing a lot of jump rope exercises to stay fit during the lockdown.</p>\n<p><strong>Today, what can we do to support your organisation?</strong><br><br><em>Benoy</em>: Donations are welcome because there are constantly a few communities that would like our service pro bono. Also, we are always looking for like-minded people with different skill sets than ours to help us do things better and figure out how to take this best forward. Finally, we look for volunteers to capture our games' greatest moments to communicate about what we are doing.</p>\n<blockquote>\n<p>It is rare to have both high performance and spirit in a team. In India, the teams that generally win have traditionally not been high on spirit scores. We managed to keep our kids competitive without them becoming aggressive.</p>\n</blockquote>\n<p><strong>What do you feel have been your greatest achievements?</strong><br><br><em>Benoy</em>: Winning a tournament while having a highly-rated spirit performance is a great achievement for us. Also, we love it when a community reaches out to us to start playing.<br><br><em>Vivek</em>: Yes, I agree. Indeed, it is rare to have both high performance and spirit in a team. In India, the teams that generally win have traditionally not been high on spirit scores. We managed to keep our kids competitive without them becoming aggressive. I do not know how we did it, but it is one of our most outstanding achievements!<br><br><strong>I am aligned with that approach. I believe it is good to seek excellence, but never at the expense of other people. </strong><br><br><em>Vivek</em>: Yes, exactly! The only person we have to beat is ourselves. You can see this mindset in our videos about our jump-rope workouts. You can notice a huge difference between the beginning and eight months later: this reflects their mentality and how they want to achieve mastery and excellence in what they are doing.<br><br><em>Benoy: </em>Yes, it is noticeable, and it gives me a lot of joy. When I started playing in 2015, I played against a team with smaller kids, so it was easy to throw the Frisbee above their heads, and we ended up winning the game. However, they worked on themselves, learned from their defeats, and never gave up, and now the tables have turned completely: they are one of the best teams in the country at this point. <br><br><strong>What do you envision for the years to come?</strong><br><em>Vivek</em>: Our mission is to spread out Ultimate Frisbee to as many children as possible. </p>\n<blockquote>\n<p>To everyone, come and play!</p>\n</blockquote>\n<p><strong>Would you like to share anything else with the people who are going to see this interview?</strong></p>\n<p><em>Benoy</em>: Try Ultimate Frisbee! If you want to start anywhere in India, reach out to us on our social media platforms, and we will get back to you and support you with whatever you need, even tools to help you build your community to reach out to more children. </p>\n<p>If you are an educator, I would like to share how sports are a great tool to teach children how to accept, recover and learn from a failure. Indeed, even if you put your best foot forward in sports, things might not go as planned.<br><br>To everyone, come and play!</p>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/group-2.jpg\" data-size=\"1080x810\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/group-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"540\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/group-3-with-frisbees.jpg\" data-size=\"1080x810\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/group-3-with-frisbees-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"540\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/in-motion.jpg\" data-size=\"1080x607\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/in-motion-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/frisbees-gk-mad.jpg\" data-size=\"1992x1121\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/frisbees-gk-mad-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"405\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-1.jpg\" data-size=\"1080x810\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-1-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"540\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-2.jpg\" data-size=\"1080x810\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"540\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-3.jpg\" data-size=\"1080x810\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-3-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"540\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-4.jpg\" data-size=\"1080x565\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/playing-4-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"377\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/solidarity.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/solidarity-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/spirit-circle.jpg\" data-size=\"1080x565\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/spirit-circle-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"377\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/strategy.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/strategy-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/11/gallery/team-spirit.jpg\" data-size=\"1080x565\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/11/gallery/team-spirit-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"377\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post. I hope you enjoyed it! If you are a social entrepreneur and would like to chat with me, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn.</a> I am looking forward to chatting with you :-)</p>\n<p>You can also get more information about Y-Ultimate on <a href=\"https://www.linkedin.com/company/y-ultimate/\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a>, <a href=\"https://www.facebook.com/YUltimate.org/\" target=\"_blank\" rel=\"noopener\">Facebook</a> and <a href=\"https://www.instagram.com/yultimate_org/\" target=\"_blank\" rel=\"noopener\">Instagram</a>.</p>\n<p> </p>",
            "image": "https://blog.socialimpactguild.com/media/posts/11/playing-3-2.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-02-27T14:08:38-05:00",
            "date_modified": "2021-04-27T21:38:57-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/power-to-girls.html",
            "url": "https://blog.socialimpactguild.com/power-to-girls.html",
            "title": "Building Community Engagement w/ Power to Girls",
            "summary": "<p>With Aisha Addo, Founder at Power to Girls Foundation, we discussed about empowering Black and marginalised girls and uncovered insights into building community engagement.</p>\n",
            "content_html": "<p>With Aisha Addo, Founder at Power to Girls Foundation, we discussed about empowering Black and marginalised girls and uncovered insights into building community engagement.</p>\n\n<h2>About Power to Girls</h2>\n<p>Aisha came to Canada as an immigrant. In her teenage years, she realised she did not have places to express herself. Everything shifted when she ended up in foster care, and  her foster mom explained to her that the system did not necessarily expect much of her: \"[she] was expected to either become a teenage mom, dropout, drug addict\". </p>\n<p>These two experiences, coupled with other ones, became the driving forces behind Power to Girls.</p>\n<p>For the past eight years, Power to Girls has been providing leadership, personal development, mental health, and entrepreneurship training to support Black and marginalised girls in Canada and Ghana.</p>\n<p>Through partnerships with schools, they deliver their programs to girls in middle school (6th to 8th grades) to ensure that the girls have a space that allows them to be themselves and become whomever they want to be in the future.</p>\n<p>As a result of their initiatives, they notice changes in their girls' confidence and communication skills. Getting closer to the end of the programs, they become more comfortable in who they are and confident to speak up their mind. Also, some <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">girls have started their businesses thanks to their entrepreneurship program.</span></p>\n<p>Currently, Power to Girls is recruiting mentors and testers for their app. Also, donors and supporters are always appreciated.</p>\n<h2>Insights Into Building Community Engagement</h2>\n<p>To build an engaged community, Power to Girls uses the following approach:</p>\n<ul>\n<li>Working with people who <strong>believe in their vision</strong><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">. Aisha thinks \"it is crucial to work with people smarter than you and actually care about what you are working on, as it generates a sense of ownership\".</span></li>\n<li>Creating partnerships with people who will become <strong>champions</strong> of the organisation and who will support it throughout its journey and growth.</li>\n<li>Creating a <strong>sense of connection</strong> by \"reinforcing who [they] are as individuals.\"</li>\n<li>Continuously reminding the girls that Power to Girls is a <strong>safe space</strong> to talk, and that everything they are doing is for their benefit.</li>\n</ul>\n<p>Currently, the organisation has mentors and 15 facilitators that they can always count on. They provide people who want to be part of the organisation with <strong>training </strong>so they can provide training themselves.</p>\n<p>Today, most of the girls that participate in their programs come back as mentors or facilitators eventually. The majority of their facilitators are girls that have participated in their program in the past.</p>\n<h2>Inspiration to Go!</h2>\n<blockquote>\n<p>The idea is taking it one day at a time, being conscious that can accomplishing everything that we set our minds to, and ensuring that we are safe while we do so.</p>\n</blockquote>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/background.png\" data-size=\"1849x1231\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/background-thumbnail.png\" alt=\"\" width=\"720\" height=\"479\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girls.jpg\" data-size=\"1536x1229\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girls-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girlsdancingonstage.jpg\" data-size=\"1833x1222\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girlsdancingonstage-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girlshugging.jpg\" data-size=\"3719x2875\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girlshugging-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"557\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girlwatchingpresentation.jpg\" data-size=\"2000x2500\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/girlwatchingpresentation-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"900\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/MDconference.jpg\" data-size=\"1500x1000\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/MDconference-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/powertogirls_volunteersmentors.jpg\" data-size=\"1536x1022\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/powertogirls_volunteersmentors-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"479\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/yogateacherinclass.jpg\" data-size=\"1500x1875\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/yogateacherinclass-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"900\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/18/gallery/app.jpeg\" data-size=\"864x1080\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/18/gallery/app-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"900\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post. I hope you enjoyed it! </p>\n<p>If you are a social entrepreneur and would like to chat with me, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/18/background.png",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-02-17T17:40:00-05:00",
            "date_modified": "2021-04-27T22:25:26-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/sahithya-anumolus-journey-to-become-a-social-entrepreneur.html",
            "url": "https://blog.socialimpactguild.com/sahithya-anumolus-journey-to-become-a-social-entrepreneur.html",
            "title": "Tackling Some Frequent Entrepreneurship Challenges w/ Inqui-Lab",
            "summary": "<p>With Sahithya Anumolu, Co-founder at the Inqui-Lab Foundation, we discussed about fostering problem-solving skills among children and uncovered insights into tackling some frequent entrepreneurship challenges.</p>\n",
            "content_html": "<p>With Sahithya Anumolu, Co-founder at the Inqui-Lab Foundation, we discussed about fostering problem-solving skills among children and uncovered insights into tackling some frequent entrepreneurship challenges.</p>\n\n<h2>About Inqui-Lab</h2>\n<p>The Inqui-Lab Foundation started in 2017 and has recently moved from impacting the lives of 3,000 to 23,000 children through a program called the School Innovation Challenge, in partnership with UNICEF, the Telangana State Innovation Cell, the Education Department of Telangana and volunteering makers.</p>\n<p>They believe that <em>\"all children should have the same opportunity to explore, learn and excel\"</em>. </p>\n<p>Today, I would consider them a <a href=\"https://blog.socialimpactguild.com/what-is-a-social-entrepreneur.html\" target=\"_blank\" rel=\"noopener noreferrer\">social entreprise</a> since the foundation is a nonprofit, generating revenues through workshops and other activities to grow its operations. They are primarily focused on impacting the lives of students from economically disadvantaged places at a large scale while ensuring a sustainable business.</p>\n<p>Sahithya and her co-founders Eshwar Bandi and Vivek Piddempally knew each other for less than a year before they launched the foundation. They readily established a <strong>shared vision</strong> through discovery and communication. However, growing their skills as social entrepreneurs required mentorship, time, and peer feedback, to shift from a project to an organisation.</p>\n<h2>Insights Into Entrepreneurship Challenges</h2>\n<p>Social entrepreneurship comes with its challenges, often unrelated to a social cause. In this case, Sahithya mainly highlighted challenges revolving around personal development, establishing boundaries to work, thinking about the big picture and scaling. None of which are directly linked to their purpose.</p>\n<h3>Taking Care of Ourselves</h3>\n<p>Struggling with boundaries between work and personal life is something that often comes up for entrepreneurs. We tend to have difficulties determining <strong>when to stop working </strong>and forget to take care of ourselves during the process, sometimes leading to burnout or less effective and efficient work. If we forget ourselves, I would say it is essential to take it easy and move on.</p>\n<p>Also, I have noticed several women entrepreneurs talk about their need for accomplishing too much too fast. Sahithya mentioned her <strong>impatience</strong> vis-<span class=\"ILfuVd\"><span class=\"hgKElc\">à</span></span>-vis her learning curve or how rapidly Inqui-Lab was growing. </p>\n<p>To overcome these challenges, she highlighted two main takeaways:</p>\n<ul>\n<li>Proactively <strong>talking</strong> to other people brings you <strong>perspective</strong> and insights that can help you along the way <span class=\"nounderlines\">– even though it can be difficult when you are introverted, it is worthwhile</span>. </li>\n<li>Getting time to exercise, meditate, read and build skills energises you by <strong>taking a step back</strong> and establishing boundaries to work.</li>\n</ul>\n<h3>Building Partnerships</h3>\n<p>Contextually, Sahithya also recognises that it has been difficult to learn from organisations in India that are doing similar work unless they are partners <span class=\"nounderlines\">– even though they share the same goals</span>. She even mentioned wondering what each of her project's unique value was after talking to some of her peers. This feeling is also something that many entrepreneurs seem to experience. With time, Sahithya has seen the value in establishing <strong>partnerships </strong>by witnessing first-hand the power of Inqui-Lab's collaborations with UNICEF, UNLEASH, and other organisations.</p>\n<p>In this regard, I would say that we should ask ourselves whether a partnership could exist and how could it lead to <strong>accomplishing greater outcomes</strong> while keeping in mind the end goal: having more impact, offering something unique, sharing resources, learning from each other, etc. </p>\n<h3>Adapting to the New Macro Environment</h3>\n<p>Even though COVID-19 impacted Inqui-Lab's operations, they quickly thought about delivering their programs to students in a different way. They did multiple <strong>experiments </strong>and ended up designing the previously mentioned School Innovation Challenge with UNICEF.</p>\n<p>Macro shocks tend to accelerate something that was already going to happen by constantly pushing you to adapt through <strong>innovation</strong>. In times like this, I think it is important to have a high-level perspective to understand the situation and its implications and imagine what steps we should take to blossom. Often, as for this instance, opportunities emerge in these uncertain times <span class=\"nounderlines\">– </span>where the cards have been reshuffled for everyone and where we need to think differently.</p>\n<h2>Inspiration to Go!</h2>\n<blockquote>\n<p>Next time, when you do see a problem, ask a child what he or she would do about it, and you would be surprised by what they say.</p>\n</blockquote>\n<hr>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>. I am looking forward to it!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/19/journey-2.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Social Entrepreneurship",
                   "Interview"
            ],
            "date_published": "2021-02-12T20:24:00-05:00",
            "date_modified": "2021-04-29T07:25:17-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/a-shining-parenthesis-with-kind-karmas-laurinda-lee-retter.html",
            "url": "https://blog.socialimpactguild.com/a-shining-parenthesis-with-kind-karmas-laurinda-lee-retter.html",
            "title": "Creating Synergy Between Social Impact and Business w/ Kind Karma",
            "summary": "<p>With Laurinda Lee-Retter, Founder of the Kind Karma Company, we talked about supporting at-risk and homeless youth and uncovered insights into creating a synergy between social impact and business.</p>\n",
            "content_html": "<p>With Laurinda Lee-Retter, Founder of the Kind Karma Company, we talked about supporting at-risk and homeless youth and uncovered insights into creating a synergy between social impact and business.</p>\n\n<h2>About Kind Karma</h2>\n<p><a href=\"https://kindkarmaco.com\">Kind Karma</a> is a social enterprise that employs at-risk and homeless youth in Toronto to handcraft fine jewellery. The company returns proceeds to support the youth's individual goals such as funding, education, housing, courses, among others.</p>\n<p>Laurinda could not finish her university degree because she had mental health challenges during her third year. As she was recovering from mental illness, it was very challenging to find work.</p>\n<p>Looking back, she thought about \"how challenging it must be for youth in vulnerable situations. They grew up in environments where survival had to be their primary focus, and they might not have the wherewithal to get a degree or go to university.\" So, she wanted to create employment options that helped them find purpose and success <span style=\"font-weight: 400;\">differently</span>.</p>\n<p>Today, Kind Karma has created a safe and welcoming space for youth, where they feel better and are able to hold on to their job longer than they had in the past. For Laurinda, \"knowing that [she] has created a little bit of a difference in someone's life  [...] means more than anything physical or any accolades\".</p>\n<p>She would love to expand her company's footprint to help more youth across Canada. To support Kind Karma, you can purchase their products at <a href=\"https://kindkarma.ca/\">kindkarmaco.com</a> and follow them on their social platforms.</p>\n<h2>Insights Into Creating a Synergy Between Social Impact and Business</h2>\n<p>Kind Karma is a perfect example of symbiosis between social impact and business. Laurinda's primary goal is to support more youth, and she is doing it by further developing her business. Both endeavours <strong>reinforce </strong>each other.</p>\n<p>To achieve this outcome, Laurinda realised that if her youth have a healthy lifestyle they would be able to commit better to their jobs, reducing turnover within the company. She, therefore, implemented the following initiatives:</p>\n<ul>\n<li><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">A point system where youth are rewarded for creating healthy lifestyles. </span></li>\n<li><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">A mentorship program to help her youth get answers and support in areas they want to grow.</span></li>\n<li>A safe space where they can not only work but also enjoy life.</li>\n</ul>\n<p>As a result, Laurinda noticed that her employees felt happy at work and did not want to leave her company. Also, her youth are already looking for ways to give back and support their community. </p>\n<h2>Inspiration to Go!</h2>\n<blockquote>\n<p>We are all in one world, we are all working together to make it a better place, and we should all support each other regardless of what we are doing and be kind to each other.</p>\n</blockquote>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-10.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-10-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-5.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-5-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-6.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-6-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-7.jpg\" data-size=\"661x465\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-7-thumbnail.jpg\" alt=\"\" width=\"661\" height=\"465\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-8.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-8-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-9.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-9-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-11.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-11-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-1.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-1-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-2.jpg\" data-size=\"774x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/20/gallery/image-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"893\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn.</a> I am looking forward to it!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/20/image-7-2.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-02-08T16:22:00-05:00",
            "date_modified": "2021-04-29T07:33:49-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/diving-into-local-currencies-with-tlcs-aziza-mohammed.html",
            "url": "https://blog.socialimpactguild.com/diving-into-local-currencies-with-tlcs-aziza-mohammed.html",
            "title": "Fueling Local Economies w/ Toronto Local Currency",
            "summary": "<p>With Aziza Mohammed, CEO at Toronto Local Currency (TLC), we talked about local currencies and uncovered insights into how they can fuel local economies.</p>\n",
            "content_html": "<p>With Aziza Mohammed, CEO at Toronto Local Currency (TLC), we talked about local currencies and uncovered insights into how they can fuel local economies.</p>\n\n<h2>About Toronto Local Currency</h2>\n<p>Aziza decided to use some of her expertise in the international development realm to help address the COVID crisis in her hometown, Toronto, by creating the <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">Toronto Local Currency.</span></p>\n<p>Toronto Local Currency is a physical note, which helps to reduce the barriers to adoption and increase security. They worked with a local artist to develop symbolism that captures the history and spirit of Toronto and Canada. Aziza hopes that \"people will feel pride in using it and will want to buy\", which is part of her revenue-generating and sustainability model.</p>\n<p>Toronto Local Currency aims to empower people to make their own best decisions and do it in a way that helps benefit the local economy. People can buy it at an exchange rate of two to one (e.g. 20 Canadian dollars for 10 TLC) or directly donate to the company.</p>\n<h2>Insights Into Local Currencies</h2>\n<h3>Incentivising People to Buy Locally</h3>\n<p>Local currencies have the potential to fuel local economies as they incentivise people to buy from local businesses. <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">It is not a new idea at all. Local currencies have been used since Mesopotamian times and were quite popular during the Great Depression. To this day, around 200 local currencies are operational around the world.</span></p>\n<p>The inspiration behind it is to get money to the people who need it most and build a community. In international development, this is called a \"conditional cash transfer\". In the case of Toronto Local Currency, the condition is that they spend it locally. So, \"the money stays in Toronto rather than making Jeff Bezos a richer man\", Aziza explains.</p>\n<p>Also, in TLC's case, people must spend it on items that will improve their lives. So, TLC put some limitations in place (e.g. no lottery tickets, alcohol) to maximise impact and increase donors' confidence in this vehicle.</p>\n<h3>Learning From Past Failures</h3>\n<p>Toronto already had a few local currencies in the past. </p>\n<p>\"The Toronto dollar failed because of the way it was structured\", Aziza underlines. Indeed, \"it took a commission from retailers who accepted it, and donated this commission to charity\". However, losing a percentage of your revenue on each transaction adds up for a small business owner. Therefore, it did not inspire business owners to adopt the currency.</p>\n<p>Otherwise, a virtual currency failed because it was highly speculative and tied into the Bunz trading platform. Eventually, \"it was just too far removed from actual value to be real\". So, the value proposition and economic model collapsed because there was not enough Canadian money to back the virtual one.</p>\n<p>Toronto Local Currency learned from these experiences to ensure that it would have more stability and not be speculative. It <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">does not take any commission from the retailers and service providers who accept it. Also, \"people can be confident that every TLC does stand for a Canadian dollar\", Aziza says. TLC thus becomes an interesting way to inject liquidity into the Toronto market, inspire more spending locally and benefit local businesses the most.</span></p>\n<h2>Inspiration to Go!</h2>\n<blockquote>\n<p>Not everyone is going to have confidence in you. It should not keep you from what you are meant to do; you might have the idea for the next big thing that could do a lot of good and change many people's lives for the better.</p>\n</blockquote>\n<hr>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn.</a> I am looking forward to it!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/21/Toronto.jpeg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-01-28T19:11:00-05:00",
            "date_modified": "2021-04-29T07:33:32-04:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/a-moment-with-smart-chelis-pratiksha-pandey.html",
            "url": "https://blog.socialimpactguild.com/a-moment-with-smart-chelis-pratiksha-pandey.html",
            "title": "Creating Gender Balance in STEAM w/ Smart Cheli",
            "summary": "<p>With Pratiksha Pandey, CEO at Smart Cheli in Nepal, we talked about creating gender balance in STEAM (Science, Technology, Engineering, Arts and Mathematics).</p>\n",
            "content_html": "<p>With Pratiksha Pandey, CEO at Smart Cheli in Nepal, we talked about creating gender balance in STEAM (Science, Technology, Engineering, Arts and Mathematics).</p>\n<hr>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/_I5jUzqtf84?t=5s\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><strong>Could you present yourself and your organisation?</strong><br>Thank you, Nadia, for having me. Hi, I am Pratiksha Pandey. I am from Nepal, and I have been working in this field for five years. Also, I am currently working as a mentor for the <a href=\"https://www.nyas.org/programs/global-stem-alliance/1000-girls-1000-futures/\" target=\"_blank\" rel=\"noopener noreferrer\">\"1000 Girls, 1000 Futures\" program</a> for the New York Academy of Science, and I am leading the organisation Smart Cheli (<em>Smart Daughter</em>) here in Nepal. Smart Cheli is an organisation that provides STEAM education to young girls. We offer STEAM workshops and mentorship. In the STEAM workshops, we involve the young girls in project-based learning in our space. During the mentorship program, we connect them with mentors based on their interests. We also provide STEAM workshops in schools as extracurricular activities.</p>\n<blockquote>\n<p>There is no gender-based subject. It's all up to you. It's all up to your interest.</p>\n</blockquote>\n<p><strong>Why did you start this organisation? What was the motivation behind it?</strong><br>When I was in college, I was doing a Bachelor in Electronics and Communications Engineering - and we were three girls. Before that, many people were saying that engineering is not for girls - and that it is hard for them. But, in my classroom, we were three girls, doing the same things like boys and getting the same marks, so it didn't make sense! That made me feel like that there is no gender-based subject. It's all up to you. It's all up to your interest. These are stereotypes that make us feel that we are less capable than others. So, many girls are falling behind and not joining these fields because of these stereotypes. To avoid this, we need to go back to the schools, increase awareness among young girls and make them feel they are not less capable.<br><br><strong>What have been your most exciting achievements or experiences during your social entrepreneurship journey?</strong> <br>Before Smart Cheli, I was engaged with Women In STEM in Nepal. When I was working with that organisation, I was awarded the <a href=\"https://www.cledepeau-beaute.com/int/powerofradiance-2020.html\" target=\"_blank\" rel=\"noopener noreferrer\">Power of Radiance Award 2020</a> for my work in education. That is not a significant achievement because there are so many things yet to achieve, but this award recognised our work worldwide. Yes, that was the happiest moment in my life!</p>\n<blockquote>\n<p>We are human beings, and we want to face people when we talk to them.</p>\n</blockquote>\n<p><strong>How did the COVID-19 pandemic impact your organisation?</strong><br>Yes, COVID has impacted us because some schools are opening, but many are still closed. So, we are not going back to the schools, and now, we are just doing virtual sessions for girls. We are not able to bring them into our space and watch their performance by ourselves. It makes everything more monotonous. We are human beings, and we want to face people when we talk to them. The pandemic makes things a little bit complicated, but it will pass, and things will go back to the way they were before.<br><br><strong>Before COVID-19, what other challenges have you faced as a social entrepreneur? </strong><br>Before the pandemic, we planned to reach out to programs in other districts in Nepal and reach out to more girls who do not have access to STEAM education. These plans are postponed for now, but we will resume them after the situation becomes normal again.<br><br><strong>What is your vision for the years to come? Do you generate revenues to sustain your purpose or rely solely on donations and government grants?</strong><br>Currently, we are sustained by grants, and we are also planning to be self-sustained. It is not possible to be entirely self-sustained, but we are planning to generate some revenues, from our workshops, for instance, that will help us in some way. We are also looking to collaborate with the local government to reach more people and seek other grants or apply for not-for-profit organisation programs. We are trying to make everything more effective and sustainable.<br><br><strong>How would you define a social enterprise?</strong><br>Yes, there are lots of definitions for it. And also, they can be different in different countries. At first, I thought that a social enterprise is an enterprise that serves society somehow and takes money from it, which will help grow the organisation. However, in Nepal, that definition is slightly wrong because a social enterprise is just a company that uses grants and cannot make a profit. It's not a profit-making company, but we can use revenues to organise and manage our office.</p>\n<blockquote>\n<p>Let's spread positivity and inspire more people around the world!</p>\n</blockquote>\n<p><strong>Would you like to share anything else with the people who are going to see this interview?</strong><br>Let's spread positivity and inspire more people around the world!</p>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/What-is-STEM.png\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/What-is-STEM-thumbnail.png\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/girls.jpg\" data-size=\"2048x1365\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/girls-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom.JPG\" data-size=\"5184x3456\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom-thumbnail.JPG\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom-2.JPG\" data-size=\"5184x3456\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom-2-thumbnail.JPG\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-1.png\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-1-thumbnail.png\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-2.png\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-2-thumbnail.png\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/workshop.jpg\" data-size=\"2048x1448\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/workshop-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"509\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/virtual-session.jpg\" data-size=\"1920x905\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/virtual-session-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"339\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post!</p>\n<p>If you are a social entrepreneur and would like to share your experience, reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>. I am looking forward to it!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/3/girls-2.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-01-18T12:28:00-05:00",
            "date_modified": "2021-04-28T10:37:24-04:00"
        }
    ]
}
