{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Social Impact Guild",
    "description": "",
    "home_page_url": "https://blog.socialimpactguild.com",
    "feed_url": "https://blog.socialimpactguild.com/feed.json",
    "user_comment": "",
    "icon": "https://blog.socialimpactguild.com/media/website/logo-white-pink-bg-round-2.png",
    "author": {
        "name": "Nadia Humbert-Labeaumaz"
    },
    "items": [
        {
            "id": "https://blog.socialimpactguild.com/power-to-girls.html",
            "url": "https://blog.socialimpactguild.com/power-to-girls.html",
            "title": "The Story of Power to Girls&#x27; Aisha Addo",
            "summary": "<p>Last week, I had the pleasure to talk with Aisha Addo, founder at <a href=\"https://www.powertogirls.com/\" target=\"_blank\" rel=\"noopener\">Power to Girls Foundation</a>. Power to Girls is a social enterprise that empowers marginalised girls in Canada and Ghana through a variety of programs and mentorship. Discover Aisha's journey as a social entrepreneur, and how she has helped these young girls achieve their full potential, through this short interview! </p>\n",
            "content_html": "<p>Last week, I had the pleasure to talk with Aisha Addo, founder at <a href=\"https://www.powertogirls.com/\" target=\"_blank\" rel=\"noopener\">Power to Girls Foundation</a>. Power to Girls is a social enterprise that empowers marginalised girls in Canada and Ghana through a variety of programs and mentorship. Discover Aisha's journey as a social entrepreneur, and how she has helped these young girls achieve their full potential, through this short interview! </p>\n<hr>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/zZR7TbejN7s\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><strong>Can you tell me about yourself?</strong><br><br>Thank you so much for having me. My name is Aisha, and I am the founder of an organisation called Power to Girls. We provide leadership, personal development, mental health, and entrepreneurship training to support Black and marginalised girls. We have been doing this for the past eight years, and it is something that I care deeply about.</p>\n<p><strong>Can you tell me more about the activities that you do to support these young girls?</strong><br><br>Yes, absolutely. We have a partnership with the <a href=\"https://www.tcdsb.org/\" target=\"_blank\" rel=\"noopener\">Toronto Catholic District School Board</a> to deliver our programs within the schools.</p>\n<p>We focus mainly on girls that are in middle school (6th to 8th grades), and essentially run a series of programs and workshops that highlight and address our four main pillars: mental health, leadership, mentorship and entrepreneurship.</p>\n<p>We ensure that the girls are given a space that allows for them to be themselves, pick up on all these programs, and become whoever they want to become in the future.<br><br><strong>What were your drivers and motivation to start the foundation?</strong></p>\n<p>I came to Canada as an immigrant, and my first experience was in high school. I was going through my teenage years, and could not find a space that allowed me to tap into the questions I had, as a source of empowerment. Seeing that Black girls did not have places to express themselves was a first key motivator for me to start Power to Girls.</p>\n<p>Everything shifted when I ended up in foster care (from 15 to 18 years old). I remember my foster mom having a conversation with me and explaining to me that the system that has been assigned to me did not necessarily expect much of me. Basically, I was expected to either become a teenage mom, a dropout, a drug addict, etc. </p>\n<p>I remember saying to myself <em>\"I'm not going to be a stereotype!\"</em>.</p>\n<p>These two experiences coupled with other ones<span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\"> became the driving forces for Power to Girls, as I realised that even girls that might not necessarily find themselves in foster care still need sources of inspiration and have those moments of questioning about who they are.</span></p>\n<p><strong>Can a young girl get support after the middle-school programs?</strong></p>\n<p>We focus on young girls in middle school, but we still provide support later on, when they get into high school for instance.</p>\n<p>In the next couple of months, we are launching My Power App, an application that focuses specifically on connecting girls to mentors, and providing support through the app itself.</p>\n<p>So, we are really proud of the beautiful cycle it becomes. Indeed, the girls that participate in our programs always end up coming back as mentors or facilitators. The majority of the facilitators that we have now are girls that have participated in our program in the past. Once you have joined Power to Girls, you are part of the Power to Girls family.<br><br><strong>What effects have you noticed in the lives of the girls that you are helping as a result of your initiatives?</strong><br><br>This is always a very interesting question because our programs focus on self-reflection and personal development.</p>\n<p>It is always beautiful to notice the changes within our girls. We have programs where some people are super quiet in the beginning but, getting closer to the end of the programs, they become more comfortable in who they are and more expressive. Also, <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">we have had girls that have started their own businesses in one of our entrepreneurship programs, a</span><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">nd we have seen them getting the confidence to share and talk about their businesses. </span></p>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">So, we witness changes in their communication style and self-confidence. We are also able to see them being comfortable and beautiful in their own body, and feeling confident enough to speak up when something does not feel right for them.</span></p>\n<p><strong>I find your organisation interesting, because you provide these girls with a holistic support system, including a set of complementary tools that let them blossom. I think it helps them today, and it will also open opportunities for them in the future. Also, it is great to see that they are able to support other girls later on as well.</strong></p>\n<p><strong>Let's talk more about your journey as a social entrepreneur. What steps did you take to create the foundation, and how long did it take to kick start it?</strong><br><br>Yes, that is a really good question. I started Power to Girls when I was in college. So, it started based on my passion of not having girls experience some of the things that I had in Canada and society in general.</p>\n<p>Then, I realised that I wanted to turn it to more than a passion down the road. So, I wondered, how do I turn this passion into purpose? How can I turn this project into something that is beyond myself, that will still strive and go on even when I am not around? The journey has not been easy: you have to find the right people, support, and many other things related to the entrepreneurial journey itself.</p>\n<p>Currently, we have 3 full-time staff, 15 facilitators that we can always count on, and mentors. We also have folks that want to be a part of our organisation, we provide them with training and then, they go back and provide training themselves. So, we are now running an amazing, oiled machine which not only provides employment, but also support.</p>\n<p>I am recognising the magnitude of what we are doing, now that I am speaking to you. It has been a process, and we did not get here overnight. It was something that we worked hard to make happen.</p>\n<p>I am also able to share this because I have got some great people that believe in the vision and the work that we are doing. I think it is crucial to work with folks that are smarter than you, but also actually care about what you are working on as it generates a sense of ownership.<br><br><strong>It is rare to see something happen overnight. It is a good thing to work on something that you care about to be able to enjoy the effort that you will have to put on. Even for the people that appear to have succeeded overnight, it usually involves a lot of experiences, maybe some failures, a lot of work, etc. </strong></p>\n<p><strong>So, what have been your biggest challenges at the different stages of your journey?</strong><br><br>One of the biggest challenges I have had is accessing capital. When the need arises, I do not mind taking out of my pocket, because it is something that I care deeply about. </p>\n<p>Otherwise, since I originally studied accounting in school, and social work was not my first choice, accessing the resources, skills and support that would allow us to scale the organisation is challenging as well.<br><br><strong>How have you been tackling these challenges?</strong></p>\n<p>It is a matter of networking and trying to find different opportunities for us to build partnerships. Also, applying to more grants.</p>\n<p>Otherwise, having the platform that we are currently creating is also allowing us to automate things.</p>\n<p>Finally, we look for people that are going to become champions of the organisation and support us, throughout our growth and journey. We are so grateful for the partners that we have now and the ones to come.<br><br><strong>What is the status of your organisation? Do you generate revenues to sustain your purpose?</strong><br><br>We are a not-for-profit organisation registered in Canada, and in Ghana as well. We do generate revenues from the sale of our merchandise, which are funneled back into the organisation.<br><br><strong>How has the pandemic affected your work and how have you adapted so far?</strong><br><br>We are closely tied to the school and education system. Whatever happens to the school system indirectly happens to us. Also, as a result of the pandemic, some funding has been put on hold.</p>\n<p>When the pandemic first started, we were very focused on ensuring that people and our communities were safe. Now, we are adapting into a more online module, which has been great for us as we have been able to reach more people.</p>\n<p><strong>Do you have any strategies to tackle the challenges resulting from moving to online programs?</strong></p>\n<p>Reinforcing who we are as individuals to create a sense of connection. Also, we continuously remind people that it is safe space to talk, and that everything we are doing is for their benefit. </p>\n<p><strong>What do you feel have been your greatest achievements as a social entrepreneur?</strong><br><br>Right now, I am really excited about the app, and just what we have done with it in the middle of the pandemic, because it is something that I have always wanted to do.<br><br>Also, I am very proud of my team, the people that I got the opportunity to work with, and my girls for always showing up and being present.<br> <br>Finally, I am proud of myself for sticking it through, because it has not been an easy journey and many times we had wanted to give up, but we kept going.</p>\n<p><strong>What is your vision for the years to come and how do you plan to materialise it?</strong><br><br>At a personal level, being at peace and ensuring that everything I do stems from passion and love.<br><br>From an organisational standpoint, launching the app, impacting and supporting more girls, and expanding our work into places we have not been yet.<br> <br>The idea is taking it one day at a time, being conscious that we are capable of  accomplishing everything that we set our minds to, and ensuring that we are safe while we do so.<br><br><strong>Would you like to share anything else with the people who are going to see this interview?</strong></p>\n<p>We are recruiting for mentors as well as testers for the app. If you are interested in participating in our alpha testing, go to this link: <a href=\"https://app.powertogirls.com/\" target=\"_blank\" rel=\"noopener\">https://app.powertogirls.com/</a></p>\n<p>Donors and supporters are always appreciated. You can find out more information about Power to Girls in our <a href=\"https://www.powertogirls.com/\" target=\"_blank\" rel=\"noopener\">website</a>, <a href=\"https://twitter.com/powertogirlsca\" target=\"_blank\" rel=\"noopener\">Twitter</a>, <a href=\"https://www.instagram.com/powertogirlsca/\" target=\"_blank\" rel=\"noopener\">Instagram</a> and <a href=\"https://www.facebook.com/powertogirlsfoundation\" target=\"_blank\" rel=\"noopener\">Facebook</a>.</p>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/background.png\" data-size=\"1849x1231\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/background-thumbnail.png\" alt=\"\" width=\"720\" height=\"479\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girls.jpg\" data-size=\"1536x1229\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girls-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girlsdancingonstage.jpg\" data-size=\"1833x1222\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girlsdancingonstage-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girlshugging.jpg\" data-size=\"3719x2875\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girlshugging-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"557\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girlwatchingpresentation.jpg\" data-size=\"2000x2500\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/girlwatchingpresentation-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"900\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/MDconference.jpg\" data-size=\"1500x1000\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/MDconference-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/powertogirls_volunteersmentors.jpg\" data-size=\"1536x1022\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/powertogirls_volunteersmentors-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"479\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/yogateacherinclass.jpg\" data-size=\"1500x1875\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/yogateacherinclass-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"900\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/9/gallery/app.jpeg\" data-size=\"864x1080\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/9/gallery/app-thumbnail.jpeg\" alt=\"\" width=\"720\" height=\"900\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post, I hope you enjoyed it! </p>\n<p>If you are a social entrepreneur and would like to chat with me, feel free to reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/9/background.png",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-02-17T17:40:12-05:00",
            "date_modified": "2021-02-22T08:49:10-05:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/sahithya-anumolus-journey-to-become-a-social-entrepreneur.html",
            "url": "https://blog.socialimpactguild.com/sahithya-anumolus-journey-to-become-a-social-entrepreneur.html",
            "title": "Sahithya Anumolu&#x27;s Journey as a Social Entrepreneur",
            "summary": "<p><a href=\"https://www.linkedin.com/in/sahithyaa/\" target=\"_blank\" rel=\"noopener\">Sahithya Anumolu</a> was born and brought up in Telangana, India and her journey in education started seven years ago. She believes that <em>\"all children should have the same opportunity to explore, learn and excel\"</em>. Today, she is the co-founder of the <a href=\"https://www.inquilabfoundation.org/\">Inqui-Lab Foundation</a>, a social enterprise fostering inquisitiveness and problem-solving skills among children to <a href=\"https://blog.socialimpactguild.com/empowering-the-next-generation-of-innovators-with-inqui-labs-sahithya-anumolu.html\" target=\"_blank\" rel=\"noopener noreferrer\">empower the next generation of innovators</a>. </p>\n",
            "content_html": "<p><a href=\"https://www.linkedin.com/in/sahithyaa/\" target=\"_blank\" rel=\"noopener\">Sahithya Anumolu</a> was born and brought up in Telangana, India and her journey in education started seven years ago. She believes that <em>\"all children should have the same opportunity to explore, learn and excel\"</em>. Today, she is the co-founder of the <a href=\"https://www.inquilabfoundation.org/\">Inqui-Lab Foundation</a>, a social enterprise fostering inquisitiveness and problem-solving skills among children to <a href=\"https://blog.socialimpactguild.com/empowering-the-next-generation-of-innovators-with-inqui-labs-sahithya-anumolu.html\" target=\"_blank\" rel=\"noopener noreferrer\">empower the next generation of innovators</a>. </p>\n\n<p>The Inqui-Lab Foundation started in 2017, and has recently moved from impacting the lives of 3,000 to 23,000 children through a program called the <a href=\"https://www.inquilabfoundation.org/copy-2-of-program\">School Innovation Challenge</a>, in partnership with UNICEF, the <a href=\"https://www.teamtsic.org/\" target=\"_blank\" rel=\"noopener\">Telangana State Innovation Cell</a>, the Education Department of Telangana and volunteering makers.</p>\n<blockquote>\n<p>We started the organisation and we are running it, but we always ask ourselves on a yearly and monthly basis whether we have the skills required for the next stage or current stage of our organisation. We constantly think about what we need to plug the gaps.</p>\n</blockquote>\n<p>Sahithya and her co-founders <a href=\"https://www.linkedin.com/in/eshwarbt/\" target=\"_blank\" rel=\"noopener\">Eshwar Bandi</a> and <a href=\"https://www.linkedin.com/in/vivek-piddempally-b2242143/\" target=\"_blank\" rel=\"noopener\">Vivek Piddempally</a> knew each other for less than a year before they launched the foundation. They readily established a common vision through discovery and communication. However, growing their skills as social entrepreneurs required mentorship, time, and peer feedback, to understand what it means and shift from a project to an organisation.</p>\n<p>Today, I would consider her a <a href=\"https://blog.socialimpactguild.com/what-is-a-social-entrepreneur.html\" target=\"_blank\" rel=\"noopener noreferrer\">social entrepreneur</a> since her foundation is a nonprofit, generating revenues through workshops and other activities to grow its operations. They are primarily focused on impacting the lives of students from economically disadvantaged places at a large scale, while ensuring a sustainable business.</p>\n<blockquote>\n<p>Every six months came with its own challenges. It was either a primary skill gap, or being unhappy about where the program was at. I pick a battle every month or every three months, but I also proactively try to find solutions and see how to surpass it.</p>\n</blockquote>\n<p>Social entrepreneurship comes with its challenges, often unrelated to a social cause. In this case, Sahithya mainly highlighted challenges revolving around personal development, establishing boundaries to work, thinking about the big picture and scaling. None of which are directly linked to their purpose.</p>\n<p>Struggling with boundaries between work and personal life is something that often comes up for entrepreneurs. We tend to have difficulties with determining when to stop working and we forget to take care of ourselves during the process, sometimes leading to burnout or less effective and efficient work. If we do forget ourselves, I would say it is important to take it easy, and move on.</p>\n<p>Also, I have noticed several women entrepreneurs talk about their need of accomplishing too much too fast. Sahithya mentioned her impatience vis-<span class=\"ILfuVd\"><span class=\"hgKElc\">à</span></span>-vis her own learning curve or how rapidly the Inqui-Lab Foundation was growing. </p>\n<p>To overcome these challenges, she highlighted two main takeaways:</p>\n<ul>\n<li>Proactively talking to other people brings you perspective and insights that can help you along the way <span class=\"nounderlines\">– even though it can be difficult when you are introverted, it is definitely worthwhile</span>. </li>\n<li>Getting time in the morning for exercise, meditation, reading and skill building energises you by taking a step back and helps with establishing boundaries to work.</li>\n</ul>\n<p>Contextually, Sahithya also recognises that it has been difficult to learn from organisations in India that are doing similar work, unless they are partners <span class=\"nounderlines\">– even though they share the same goals</span>. She even mentioned wondering herself what each of her project's unique value was after talking to some of her peers. This feeling is also something that many entrepreneurs seem to experience. With time, Sahithya has seen value in establishing partnerships by witnessing first-hand the power of Inqui-Lab's collaborations with <a href=\"https://www.unicef.org/\" target=\"_blank\" rel=\"noopener\">UNICEF</a>, <a href=\"https://unleash.org/\" target=\"_blank\" rel=\"noopener\">UNLEASH</a>, and other organisations.</p>\n<p>In this regard, I think we should ask ourselves whether a partnership could exist and how could it lead to accomplishing greater outcomes, while keeping in mind the end goal: having more impact, offering something unique, sharing resources, learning from each other, etc. </p>\n<blockquote>\n<p>During the pandemic, we spent around a quarter just helping other organisations around food programs, donations, etc., which was not necessarily directly aligned to problem solving, or working with children.</p>\n</blockquote>\n<p>Even though COVID-19 impacted Inqui-Lab's operations, they quickly thought about how to deliver their programs to students in a different way. They did multiple experiments and ended up designing the previously mentioned School Innovation Challenge with UNICEF.</p>\n<blockquote>\n<p>This project was a turning point for us, but as many children do not have access to internet, we still have work to do to figure out how to best reach them.</p>\n</blockquote>\n<p>Macroshocks tend to accelerate something that was already going to happen by constantly pushing you to adapt though innovation. In times like this, I think it is important to have a high-level perspective to understand the situation and its implications, and imagine what steps we should take to blossom. Often, as for this instance, many opportunities emerge in these uncertain times <span class=\"nounderlines\">– </span>where the cards have been reshuffled for everyone and where we need to think differently.</p>\n<hr>\n<p>Thanks so much for reading this post, I hope you enjoyed it! <br>If you are a social entrepreneur and would like to chat with me, feel free to reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/7/journey.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Social Entrepreneurship"
            ],
            "date_published": "2021-02-12T20:24:53-05:00",
            "date_modified": "2021-02-22T08:49:21-05:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/empowering-the-next-generation-of-innovators-with-inqui-labs-sahithya-anumolu.html",
            "url": "https://blog.socialimpactguild.com/empowering-the-next-generation-of-innovators-with-inqui-labs-sahithya-anumolu.html",
            "title": "Empowering the Next Generation of Innovators with Inqui-Lab&#x27;s Sahithya Anumolu",
            "summary": "<p>Captivated by Sahithya Anumolu, co-founder of the <a href=\"https://www.inquilabfoundation.org/\" target=\"_blank\" rel=\"noopener\">Inqui-Lab Foundation</a>, I had the pleasure to learn ways to empower youth through problem solving and innovation. <em>Inqui </em>stands for inquisitiveness as the organisation instills it in many children from economically disadvantaged communities in India. If you want to witness a true materialisation of empowerment and discover more about this exceptional organisation, keep reading this interview!</p>\n",
            "content_html": "<p>Captivated by Sahithya Anumolu, co-founder of the <a href=\"https://www.inquilabfoundation.org/\" target=\"_blank\" rel=\"noopener\">Inqui-Lab Foundation</a>, I had the pleasure to learn ways to empower youth through problem solving and innovation. <em>Inqui </em>stands for inquisitiveness as the organisation instills it in many children from economically disadvantaged communities in India. If you want to witness a true materialisation of empowerment and discover more about this exceptional organisation, keep reading this interview!</p>\n\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/FkX27l7SFLI\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<blockquote>\n<p>Our vision is to nurture problem-solving skills in children.</p>\n</blockquote>\n<p><strong>Sahithya, can you tell me about yourself and your organisation?</strong></p>\n<p>I am Sahithya. I'm from India, a state called Telangana and city, Hyderabad. I have been in education since 2014, starting with a <a href=\"https://www.teachforindia.org/\" target=\"_blank\" rel=\"noopener\">Teach for India</a> fellowship <span class=\"nounderlines\">– which </span>was my first 101 into education and public schools. Right after, we co-founded Inqui-Lab Foundation in 2017 with two of my colleagues from Teach for India: <a href=\"https://www.linkedin.com/in/eshwarbt/\" target=\"_blank\" rel=\"noopener\">Eshwar Bandi</a> and <a href=\"https://www.linkedin.com/in/vivek-piddempally-b2242143/\" target=\"_blank\" rel=\"noopener\">Vivek Piddempally</a>.</p>\n<p>For the last three years, we have been running this organisation. Our vision is to nurture problem-solving skills in children. I am very excited about this conversation and looking forward to share more about what we do!<br><br><strong>Where do the students come from? Do you have partnerships with schools? Or, can any student reach out to your organisation?</strong></p>\n<p>As an organisation, we have decided that we want to work with public school students from socially economically disadvantaged communities. So, with that mission in mind, we basically work a lot with the public school system. For all the interventions that we design, we also keep in mind that we want to scale them through this system.</p>\n<blockquote>\n<p>We were witnessing students observing problems, coming up with creative ideas, and excited to test these ideas.</p>\n</blockquote>\n<p><strong>How do you foster student innovation?</strong><br><br>Our organisation was started by us witnessing the kind of ideas that students were coming up with in our classrooms! For example, a student had said <em>'my mother wakes up many times in the night because she has to rock my sister's cradle, and I want to make a cradle that automatically rocks as soon as my sister cries'</em>. So, we were witnessing students observing problems, coming up with creative ideas, and were excited to test these ideas.</p>\n<p>From that starting point where we saw potential, we then started looking at how best we can equip students to innovate. That is where we segwayed into the design thinking process, for example. We thought about how we can teach design thinking to children between the age group of 10 to 15. How can we simplify the process for them? And, how can we teach it at scale in schools? So, we started researching and designing around these questions.<br><br><strong>Can you tell me more about how you use design thinking?</strong><br><br>We see it as a process for problem solving and have crafted our own four-step process to use it: finding and understanding a problem, ideate to solve it, make and test (step where you iterate on your ideas), and present. The last point consists of sharing your ideas with a larger group. This four-step process is inspired by what we learned through our research on design thinking as well as local and global education for children, including at Stanford. <br><br>Design thinking is meant to be user driven. So, you get feedback from users and iterate on your ideas. Keeping that in mind, we try to ensure that, within our program, students are not just thinking about building an end product, but the process and takeaways that they get through it are equally important.</p>\n<blockquote>\n<p>The School Innovation Challenge was done in partnership with UNICEF [...]. We went from working with 3,000 students to 23,000 students by establishing multiple partnerships.</p>\n</blockquote>\n<p><strong>You mentioned that prototyping is an integral part of your four-step process. So, many of your students's ideas come to life through a prototype. Do you produce these prototypes at scale?</strong><br><br>For us, scaling is at a program level. We have two flagship programs that we run for students.</p>\n<p>One is called <a href=\"https://www.inquilabfoundation.org/copy-of-program\" target=\"_blank\" rel=\"noopener\">Think &amp; Make</a>. It is an in-school program, a weekly intervention, meant for grades 8th and 9th. Through the two years, students do multiple units of innovation. In every unit, they come up with an idea and a prototype. What we scale right now is the intervention itself. For instance, we are currently reaching two schools, how could we make take it to 5, 10, 25, 200, 5000 schools throughout the state? For the prototypes themselves, we are looking at multiple opportunities right now. They are currently making them in the classrooms and presenting them to their peers during the programs. However, we are exploring whether a great student idea can get further opportunities. Can it be implemented, mentored, funded? <br><br>The second program is called <a href=\"https://www.inquilabfoundation.org/copy-2-of-program\" target=\"_blank\" rel=\"noopener\">School Innovation Challenge</a>. We are running it as a result of COVID-19. It consists of online and in-school interventions where we codify a three-hour problem-solving course. During this course, students learn the basics of design thinking and problem solving. Then, they do a capstone project that they submit to us. This School Innovation Challenge was done in partnership with UNICEF, and brought a lot of learnings for us. For example, we went from working with 3,000 students to 23,000 students by establishing multiple partnerships. So, we understood what scaling means. This was definitely a highlight for us!<br><br><strong>Congratulations! Can you tell me more about these partnerships?</strong><br><br>I cannot imagine Inqui-Lab or any of our work without partnerships. For our School Innovation Challenge program, we had four main ones.</p>\n<p>We worked in collaboration with the <a href=\"https://www.teamtsic.org/\" target=\"_blank\" rel=\"noopener\">Telangana State Innovation Cell</a> since the beginning, a center in our state whose mission is to encourage innovation at the school, college and corporate levels.</p>\n<p>UNICEF trusted us with the program design, and also funded its development. We also partnered with the Telangana State Education Department of our state, who were willing to roll this out to 5,000 schools during the COVID time. We trained around 5,000 teachers, which then helped us take this program to the 23,000 students.  </p>\n<p>The fourth partnership I would like to highlight is with makers. The top 25 ideas received mentorship and prototyping support from individuals working in NGOs who came forward and helped us. So, there is a lot of volunteering as well, which is a significant partnership component that we would like to explore. So, we had partnerships at every step of the program: funding, program design, implementation, etc.</p>\n<blockquote>\n<p>We started to develop our own kit, which has electronics, hand tools, [...] and other materials. This is the part that kids are so excited about. They are always looking for the prototyping session.</p>\n</blockquote>\n<p><strong>Where do you source the materials and tools necessary for the prototyping?</strong><br><br>In terms of materials, we are exploring two ways. For some of our programs, we did have a partnership with another for-profit company that also builds kits. They have electronics that they donated to us.</p>\n<p>However, we had also started to develop our own kit, which has electronics, hand tools, small drill bits, small saws, wood and other materials that they can use in their prototypes. Actually, this is the part that kids are so excited about. They are always looking for the prototyping session.</p>\n<p>The main reason we started in-house design is because of the cost factor. No partnership could offer us the cost that we were aiming for the kit. We do not have a manufacturing unit, right now it is very manual and human-resource intensive. The largest kit number that we have manufactured is 300, but we will have to look at how we can ramp up our manufacturing process if we do want to scale up programs.<br><br><strong>Do you rely solely on donations or do you have other sources of revenues?</strong><br><br>From day one, we have been lucky enough to be able to diversify our fundraising. 85% of our operations depend on funding from donors, and 15% is raised through revenue via other activities, like workshops. Certain organisations were willing to pay us for the programs or kits that we delivered for their schools.</p>\n<p>In terms of our sources, we have crowdfunding, companies' donations (i.e. CSR), grants, high-net-worth individuals donations, and incubators. Every year we have had either a grant or incubator to support us. Many incubators help organisations that are at an early stage (between zero to three years). So, they have been of significant help for us from day one, because they also provided us with mentorship. My two co-founders have both been instrumental in diversifying fundraising and ensuring that the organisation has the funds to continuously run from year to year.</p>\n<blockquote>\n<p>Today, we are a 15 to 20-member team [...]. We are learning the ropes around that, as the team is growing.</p>\n</blockquote>\n<p><strong>You are three partners. Do each of you has a specific role or everyone does a little bit of everything?</strong><br><br>It has changed year to year, but we definitely have a major role that each of us plays <span class=\"nounderlines\">–</span>without having titles. For example, I focus on program design, curriculum design, etc. Vivek used to do a lot of the operations. Eshwar used to work on partnerships and fundraising. He speaks to a lot of people, brings in mentorship, and inputs from the external world.</p>\n<p>So, each of us have strategically taken on certain roles, but we have also done everything <span class=\"nounderlines\">– </span>especially when we started off (e.g. fundraising, program design, impact measurement, etc). Today, we are a 15 to 20-member <a href=\"https://www.inquilabfoundation.org/team\" target=\"_blank\" rel=\"noopener\">team</a>, and it has been an interesting journey for us. Indeed, it is not just the three of us now, so we need to have certain processes in place, a lot of project management, remote working – which has been a new challenge for us this year. So, we are learning the ropes around that, as the team is growing.</p>\n<blockquote>\n<p>Many of our mentors say that at every stage, you are a different organisation, so if your staff gets bigger, you will face different challenges. </p>\n</blockquote>\n<p><strong>How do you get from the starting point, usually a group of people that want to accomplish something together, to making an impact as you are now?</strong> <br><br>I can definitely pinpoint two or three things. Many of our mentors say that at every stage, you are a different organisation, so if your staff gets bigger, you will face different challenges. <br><br>I can say that apart from your founding team, the immediate next people who join your team are extremely important. They need to be strong critical thinkers, who are willing to question our vision and pivot our thinking in many ways. Indeed, as co-founders, we can get stuck on certain viewpoints. We were extremely lucky to get the right team at the very beginning. Every single person acted like co-founders themselves. They were able to bring initiative, ownership, and design to the organisation.</p>\n<p>Secondly, as the team was growing, we also started to take on more work. At this point, something that we have to get right is just resourcing across projects and saying no to certain things. We still struggle a bit in this area as we take on more than we can do, but we are trying to better estimate and ensure that the team is not taking on more than it can handle.</p>\n<p>The third is just learning and development. We are a young team (between 20 to 30 years of age). Some people are joining us for their first year of employment. So, we have a lot of responsibility in terms of ensuring that they have the right role models and are getting the coaching they need – which we are learning in the process.<br><br><strong>If you have to choose one thing – if possible – what would you say has been the most important point to pay attention for the foundation to blossom?</strong><br><br>I am going to keep the obvious finance fundraising aside, because that is important. So, I would say a shared vision across all the team members.</p>\n<p>Even today, we spend time to ensure this, specially as we have three people leading. For example, we have to be clear about what student innovation means to each of us. When we are saying 'we want to nurture problem-solving skills', we need to know what problem-solving skills means to us. Or on a higher level, what does success mean for Inqui-Lab? Our common understanding of that is extremely important, and it applies to the rest of the team as well.</p>\n<p>Being aligned on our vision, what we want to achieve and our goals is becoming more important to make sure everybody knows what is the most important thing to do when they get to the office everyday.</p>\n<blockquote>\n<p>When we hear stories like this, it is not just a success metric, but we see that students are beginning to believe that they can be partners in solving challenges around us. </p>\n</blockquote>\n<p><strong>What effects have you seen in the students life as a result of your initiatives?</strong></p>\n<p>Students say that, when they see a problem, they now know that they are capable of thinking about an idea. I have also seen students implement their ideas. For example, Priyavarshini, as soon as COVID hit, she had to go back to her village as schools were closed. As soon as she arrived, she made awareness posters, masks with gunny bags, and distributed them in her community. When we hear stories like this, it is not just a success metric, but we see that students are beginning to believe that they can be partners in solving challenges around them. </p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/Priyavarshini.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://blog.socialimpactguild.com/media/posts/6/responsive/Priyavarshini-xs.png 300w ,https://blog.socialimpactguild.com/media/posts/6/responsive/Priyavarshini-sm.png 480w ,https://blog.socialimpactguild.com/media/posts/6/responsive/Priyavarshini-md.png 768w\"  alt=\"Priyavarshini\" width=\"355\" height=\"378\">\n<figcaption >Priyavarshini is an inspiring student who made awareness posters and masks with gunny bags, and distributed them in her community.</figcaption>\n</figure>\n<p>Another example is Abhishek, whose idea was rated second best, among the 7000 ideas that we received in the School Innovation Challenge. He worked alongside Rajesh and Venu to conceive a low cost wearable, made with old fertiliser bags, to ease farmers' work. It was made and distributed to three families who helped test the idea. He told me that when he started interviewing people to understand the problems they were facing, he started to understand the world around him more. Also, he got to meet the high level dignitaries in our state, which is rare. Finally, he said that his parents, who were farmers, were felicitated at his school for his team's innovation. </p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/Abhishek.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://blog.socialimpactguild.com/media/posts/6/responsive/Abhishek-xs.png 300w ,https://blog.socialimpactguild.com/media/posts/6/responsive/Abhishek-sm.png 480w ,https://blog.socialimpactguild.com/media/posts/6/responsive/Abhishek-md.png 768w\"  alt=\"\" width=\"750\" height=\"425\">\n<figcaption >Abhishek and his team's low cost wearable, made with old fertiliser bags, was rated second best in the School Innovation Challenge</figcaption>\n</figure>\n<p>Otherwise, usually, the students who perform well academically are the ones who get highlighted, and everybody else is blurred out in the background, even from the teachers' perspective. In our specific classroom, we started to see that students who were providing the best ideas were not necessarily the ones who were getting the highest marks. So, we were starting to see these students also shine. They were getting recognised for their ideas and prototyping skills.</p>\n<p>It is crucial for our programs to provide an inclusive and safe space for students. We also have a set of target skills and attitudes. When we talk about problem solving, it involves design thinking, team work, risk taking, innovative mindset <span class=\"nounderlines\">–</span> which we measure during our programs as we consider them as impact. <br><br>To sum up, what brings me joy is when a student believes in their ability to solve problems and values their ideas. They are then able to get recognition from others, and people around start to see students as partners. As an organisation, we celebrate that as a big milestone.</p>\n<p><strong>What is your vision for the years to come and how do you plan to materialise it?</strong><br><br>We have been designing for a while now. So, we will focus on scaling now. We are looking at how best to have partnerships and funding to scale.<br><br>As an organisation, we are aiming for a peer led or student led model i.e. taught by the students themselves <span class=\"nounderlines\">–</span> which is a highly scalable model. Also, we want the interventions to run without Inqui-Lab: let schools or communities run them. So, we think about how we could incentivise them to run them and what is the ecosystem to support that.<br><br>Ultimately, we want to create a large network of young individuals who care about SDGs, and are willing to do what it takes to build a better world.</p>\n<p><strong>How can people help you and support your organisation?</strong><br><br>One is just collaboration with organisations for program design. The second is funding for student ideas, and schools that would like to run our programs. Finally, makers who have the skills to turn ideas into reality so that students can see the full value and impact of their innovations, helping them become social entrepreneurs in their own right. </p>\n<blockquote>\n<p>Next time, when you do see a problem, ask a child what he or she would do about it, and you would be surprised with what they say.</p>\n</blockquote>\n<p><strong>Is there anything else that you would like to share with the people who are going to see this interview?</strong><br><br>Next time, when you do see a problem, ask a child what he or she would do about it, and you would be surprised with what they say. Give every student a chance to be a problem solver!</p>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-1.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-1-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-2.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-8.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-8-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-4.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-4-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-6.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-6-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-9.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Image-9-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Hari-Priya_Low-cost-wash-basin-1-2.jpg\" data-size=\"2922x2824\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Hari-Priya_Low-cost-wash-basin-1-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"696\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Priyavarshini.png\" data-size=\"1262x598\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Priyavarshini-thumbnail.png\" alt=\"\" width=\"720\" height=\"341\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Team.jpg\" data-size=\"3388x3630\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/6/gallery/Team-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"771\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post, I hope you enjoyed it! You can support Inqui-Lab by visiting its <a href=\"https://www.inquilabfoundation.org/\" target=\"_blank\" rel=\"noopener\">website</a>, as well as following and sharing on <a href=\"https://www.instagram.com/inqui_lab/\">Instagram</a>, <a href=\"https://www.facebook.com/InquiLabFoundation/\">Facebook</a>, <a href=\"https://twitter.com/inqui_lab\" target=\"_blank\" rel=\"noopener\">Twitter</a> and <a href=\"https://www.youtube.com/channel/UCHYBAFziOOChEvOtJkASNvg\" target=\"_blank\" rel=\"noopener\">YouTube</a>. </p>\n<p>If you are a social entrepreneur and would like to chat with me, feel free to reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>!</p>\n<p> </p>",
            "image": "https://blog.socialimpactguild.com/media/posts/6/feature_image.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-02-09T21:14:30-05:00",
            "date_modified": "2021-02-17T13:54:31-05:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/a-shining-parenthesis-with-kind-karmas-laurinda-lee-retter.html",
            "url": "https://blog.socialimpactguild.com/a-shining-parenthesis-with-kind-karmas-laurinda-lee-retter.html",
            "title": "A Shining Parenthesis with Kind Karma&#x27;s Laurinda Lee-Retter",
            "summary": "<p>Today, I met with Laurinda Lee-Retter, founder of the Kind Karma Company, an enterprise which employs at-risk and homeless youth to craft lovely pieces of jewelry. I am always thrilled when I talk and learn about her and her organisation as I feel she is a reflection of her company's name and always has great ideas to achieve her amazing purpose and sustain her business. Discover more about her company though this interview!</p>\n",
            "content_html": "<p>Today, I met with Laurinda Lee-Retter, founder of the Kind Karma Company, an enterprise which employs at-risk and homeless youth to craft lovely pieces of jewelry. I am always thrilled when I talk and learn about her and her organisation as I feel she is a reflection of her company's name and always has great ideas to achieve her amazing purpose and sustain her business. Discover more about her company though this interview!</p>\n<hr>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/O_HdCMXGZ6k\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><strong>Laurinda, can you tell me about yourself and your organisation?</strong></p>\n<p><a href=\"https://kindkarmaco.com\">Kind Karma</a> is a social enterprise. We employ at-risk and homeless youth in Toronto to handcraft fine jewelry. We pay them hourly wages and, on top of that, we return proceeds back to support their individual goals such as funding, education, housing, courses, among others.</p>\n<blockquote>\n<p>It was a really hard time for me and I thought about how challenging it must be for youth who are in vulnerable situations as well.</p>\n</blockquote>\n<p><strong>What motivated you to help at-risk and homeless youth in particular?</strong></p>\n<p>I think it was my own journey. I had worked for a long time and I actually went to school, for music. So, I have always wanted to be creative. I could not finish my university degree because I had mental health challenges during my third year. So, when I came back, I struggled to find work.</p>\n<p>As I was recovering from mental illness, it was very challenging; I think the options were not really there. Some days, you just have a bad day, it is not that you do not want to be helpful or happy, but you have a bad day. So, looking back, I thought about how challenging it must be for youth who are in vulnerable situations. They grew up in environments where survival had to be their main focus, and they might not have the wherewithal to get a degree or go to university. So, I wanted to create employment options that addressed that, and helped them find purpose and success in a different way.<br><br><strong>I know that you set up programs to both further improve their lifestyle and reduce turnover. Can you tell me about these programs and their outcomes?</strong></p>\n<p>We have a couple of different things in order for proceeds to get back at work. There is a point system where youth are rewarded for creating healthy lifestyles. On top of that, we also have a mentorship program as we have a lot of great customers in professional industries, always happy to volunteer their time, and they are often asking how they can be involved. So, if we have a youth who has a question about a specific industry that they can answer to, we connect them. It helps our youth get answers and support in areas that they need to get to where they want to go.</p>\n<blockquote>\n<p>We have youth who are already looking for ways to give back and support their community.</p>\n</blockquote>\n<p><strong>What changes have you noticed in their lives as a result of working with you? </strong></p>\n<p>It has been incredible to see a variety of changes. A lot of them say that they have never been able to hold on a job as long as they have here. We have youth that say they would never want to leave because they just love it and it does not feel like work to them, which is so important. Also, when you are feeling unwell, your first instinct is to call in sick for everyone, but it has been amazing to see that our youth actually come to work and they leave saying, \"I am glad I came in today because I actually feel better having been here!\". That is such a great thing to hear!</p>\n<p>Also, it has been amazing to see that our youth want to pay it forward already. We have youth who are already looking for ways to give back and support their community and it is just so heartwarming to see because, coming from a population that does not have that much, and to have them already want to give back whatever they can, it is really inspiring. It motivates me to do what I do even more.</p>\n<p><strong>I really love your organisation because it provides people with opportunities to learn, grow and gain independence. To me, Kind Karma is what social entrepreneurship is all about: a complete symbiosis between social impact and business.</strong></p>\n<blockquote>\n<p>Learning to manage time, prioritise, find balance and have downtime was challenging [...] early on.</p>\n</blockquote>\n<p><strong>Now, I would like to talk more about your journey as a social entrepreneur. So, tell me, what have been the biggest challenges that you have had at the different stages of your journey?</strong></p>\n<p>I think as a social entrepreneur, it is challenging because there is no roadmap to entrepreneurship. You can have resources along the way but it is a very unique journey for everybody. Everyone has their own challenges because everyone has their own strengths and weaknesses.</p>\n<p>When I was starting out, my biggest challenge was finding balance in my life. I am very much an overachiever, I always needed to get things done immediately. I drove myself where I was just piling things on. Ultimately, I would not get anything done because it was just too much for me to accomplish in one day. I would get overwhelmed and beat myself up about it. Learning to manage time, prioritise, find balance and have downtime was challenging. There were times where I felt bad if I was not working and doing something for the business. It was easy for me to burn out and become not as good as I could be because my mental health was not optimal. So, it was definitely a challenge early on.</p>\n<p>And now, 2020 has been kind of a crazy year. Learning how to navigate all these changes in the way that people do business and interact with each other has been a challenge. Also, get our mission and our journey out there without being able to do in-person events or meet people has been a very different challenge.</p>\n<p><strong>It can be difficult to balance work and life in general. When you are an entrepreneur, it is even more difficult because it is your own business so you are even more involved. </strong></p>\n<p><strong>I agree with you, it is crucial to get some time for ourselves and make sure that we are taking care of our mental and physical health, because if we are not doing great ourselves, we will not be able to do good for other people or make our business work. Right now, it has probably gotten more complicated because we are spending a lot of time at home.</strong></p>\n<blockquote>\n<p>In 2020 [...] it was challenging because, for a lot of youth who do not have structure or do not even have optimal or healthy domestic environments, it is hard for them to stay focused and to even be motivated to do things.</p>\n</blockquote>\n<p><strong>I wanted to ask you, how has the pandemic impacted your operations? I remember you were using a co-working space at a university, has that changed?</strong><br><br>That was one of our challenges too in 2020. We used to work at a small co-working space and then it shut down. So, I was hardened for a while. I mailed supplies to youth to work at home but it was challenging because, for a lot of youth who do not have structure or do not even have optimal or healthy domestic environments, it is hard for them to stay focused and to even be motivated to do things.</p>\n<p>Finally, at the end of last year, we got our own space and we are excited to say that we are actually going to be moving again soon because we have already outgrown our space. It is a great problem to have and we are excited about that. It has always been my dream to have a space where our youth can come in, be safe, have snacks, play games, things like that. We are able to save space for them to enjoy not only work, but just life.</p>\n<blockquote>\n<p>It is one big community, we are all in one world, we are all working together to make it a better place, and we should all support each other regardless of what we are doing and just be kind to each other.</p>\n</blockquote>\n<p><strong>So, what have been your main takeaways during your journey while tackling these challenges?</strong></p>\n<p>I am just so happy to have found this social enterprise model. I remember when I first started, it was not something that we even talked about. You would either have a nonprofit, which did good, or you would have a business, which made money, and there was no merging of the two.</p>\n<p>It is amazing to see such a different mentality among social entrepreneurs. Some of my best friends are people who you would traditionally consider competitors, as they own jewelry companies as well, but we all just know that everybody is doing their own good in the world and it does not matter if they are selling a similar product. They are working and doing something that is also creating good change in the world. So, why can't we support each other? I love that mentality: it is one big community, we are all in one world, we are all working together to make it a better place, and we should all support each other regardless of what we are doing and just be kind to each other.</p>\n<blockquote>\n<p>Knowing that I have created a little bit of a difference in someone's life is the biggest achievement.</p>\n</blockquote>\n<p><strong>What would you say are your biggest achievements as a social entrepreneur?</strong><br> <br>Just hearing our youth saying that they came in and they felt better or that they have been able to stay here and work longer than they have in the past, that is an achievement. It means that I have created a safe and welcoming space.</p>\n<p>Those things mean more to me than anything physical or any kind of accolades. Knowing that I have created a little bit of a difference in someone's life is the biggest achievement.</p>\n<p><strong>What is your vision for the years to come and how do you plan to materialise it?</strong><br><br>I have always wanted to help youth in major cities across the country. That is on the vision board. I always feel that, in big cities, at-risk and homeless youth always tend to fall through the cracks because they are one in millions of people and there is only so many resources that can go around. So, I would love to have a Kind Karma office in major cities from coast to coast and hopefully make an impact there.</p>\n<p>Also, sometime in the future, maybe we will expand our offerings and do different kinds of things. I have always loved candles, so maybe something like that. That is a brainstorming project now, but I would love to expand our footprint across the country to help more youth.</p>\n<p><strong>What other challenges are you expecting in the future?</strong></p>\n<p>I think our next challenge might be to scale effectively. How do we make sure that, as we get bigger, everybody still has that small business feel? Or, how do we make sure that everybody still has that personal connection? Hopefully, we get bigger and get to scale, but I think every stage has its own unique challenges and I love that about it.</p>\n<p><strong>How can people support your organisation today?</strong></p>\n<p>They can visit our website <a href=\"https://kindkarma.ca/\">kindkarmaco.com</a> to learn more and, obviously, we love purchases, but even just a social media follow or share, anything like that, is always so appreciated. Our Instagram handle is <a href=\"https://www.instagram.com/kindkarmaco/\">@kindkarmaco</a>. Our Facebook is <a href=\"https://www.facebook.com/kindkarmaco\">facebook.com/kindkarmaco</a>. It does not always have to be monetary support. We also appreciate everybody sharing our story and our mission.</p>\n<p><strong>Thanks so much for sharing your story! </strong><strong>I love seeing you and talking about Kind Karma. Is there anything else that you would like to share with the people who are going to see this interview?</strong><br><br>I just want to say thank you to everyone who has supported us and who will take the time after this to look us up and read more about what we do. I cannot tell you, for us as a small business, how much that means, especially in a time where small businesses need it more than ever. So, thank you, and we really appreciate it!</p>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-10.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-10-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-5.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-5-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-6.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-6-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-7.jpg\" data-size=\"661x465\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-7-thumbnail.jpg\" alt=\"\" width=\"661\" height=\"465\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-8.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-8-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-9.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-9-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-11.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-11-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-1.jpg\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-1-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-2.jpg\" data-size=\"774x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/5/gallery/image-2-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"893\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post, I hope you enjoyed it! You can support Kind Karma by visiting its <a href=\"https://kindkarmaco.com\">website</a>, as well as following and sharing on <a href=\"https://www.instagram.com/kindkarmaco/\">Instagram</a> and <a href=\"https://www.facebook.com/kindkarmaco\">Facebook</a>.</p>\n<p>If you are a social entrepreneur and would like to chat with me, feel free to reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/5/image-7.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-02-08T16:22:54-05:00",
            "date_modified": "2021-02-16T08:15:29-05:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/diving-into-local-currencies-with-tlcs-aziza-mohammed.html",
            "url": "https://blog.socialimpactguild.com/diving-into-local-currencies-with-tlcs-aziza-mohammed.html",
            "title": "Diving into Local Currencies with TLC&#x27;s Aziza Mohammed",
            "summary": "<p>Local currencies have the potential to fuel local economies as they incentivise people to buy from local businesses. In the current macro-environmental context, they might ease the strain on small businesses. I had the chance to talk about this subject with Aziza Mohammed, CEO at <a href=\"https://www.torontolocalcurrency.org/\" target=\"_blank\" rel=\"noopener\">Toronto Local Currency</a>. Discover her initiative through this interview.</p>\n",
            "content_html": "<p>Local currencies have the potential to fuel local economies as they incentivise people to buy from local businesses. In the current macro-environmental context, they might ease the strain on small businesses. I had the chance to talk about this subject with Aziza Mohammed, CEO at <a href=\"https://www.torontolocalcurrency.org/\" target=\"_blank\" rel=\"noopener\">Toronto Local Currency</a>. Discover her initiative through this interview.</p>\n<hr>\n<blockquote>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">When looking at how people deal with crises, I saw that local currency is a tool that is often used.</span></p>\n</blockquote>\n<p><strong>Can you tell me about yourself and the Toronto Local Currency?</strong></p>\n<p>Hi Nadia, thank you for having me. I am an international development professional and I have dedicated my career to eliminating poverty abroad. My work at <a href=\"https://en.wikipedia.org/wiki/Women_and_Gender_Equality_Canada\">Women and Gender Equality Canada</a>, helping with the COVID-19 response, made me wonder about the economic crisis that had accompanied the pandemic at home. So, I decided that I should use some of my expertise in the international development realm to try and help address this crisis right here at home. <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">That is where the idea for Toronto Local Currency came up. </span></p>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">When looking at how people deal with crises, I saw that local currency is a tool that is often used. It is not a new idea at all. Local currencies have been used since the Mesopotamian times, and were actually quite popular during the Great Depression. To this day, around 100 local currencies are operational around the world.</span></p>\n<p><strong>What effects are you expecting from this local currency?</strong></p>\n<p>The inspiration behind it is to get money to the people who need it most, and make sure that it actually builds a community. In international development, we would call this a conditional cash transfer. In the case of Toronto Local Currency, the condition is that they spend it locally. So, the money stays in Toronto rather than making Jeff Bezos a richer man.</p>\n<p>Also, they must spend it on things that are actually going to improve their lives. So, there are some limitations (e.g. no lottery tickets, alcohol) to maximise impact, increase donor confidence in this vehicle and empower people. It is really about giving people the ability to make decisions for what they need the most.</p>\n<blockquote>\n<p>We worked with a local artist to come up with symbolism that captures the history and spirit of Toronto and Canada more broadly.</p>\n</blockquote>\n<p><strong>Is it a virtual currency or do you print your own money?</strong></p>\n<p>Toronto Local Currency is actually a physical note. We have been discussing with some partners having some sort of virtual platform, but it was important for us to have this be a physical note to reduce the barriers to adoption. Some people are not tech savvy, we did not want that to be a barrier to them participating.</p>\n<p>Also, we wanted to make sure it is secure and stable. A lot of online platforms can be hacked. By having a physical bill, you will eliminate some of that risk.</p>\n<p>Finally, we worked with a local artist to come up with symbolism that captures the history and spirit of Toronto and Canada more broadly. It is a beautiful-looking note that I think people will not only feel pride in using but also want to buy, which is part of our revenue generating and sustainability model.<br><br><strong>You mentioned that many local currencies exist worldwide. Actually, in my hometown in Lyon, France, we also have one (<a href=\"http://www.lagonette.org/\" target=\"_blank\" rel=\"noopener noreferrer\">\"la Gonette\"</a>). It supports the local economy and raises awareness on how currencies work. Did you get any insights from these other local currencies worldwide? </strong><br><br>Yes, the inspiration was from currencies worldwide and historical usage. There was a local currency in Toronto, called the <a href=\"https://en.wikipedia.org/wiki/Toronto_dollar\" target=\"_blank\" rel=\"noopener\">Toronto dollar</a>, that failed because of the way it was structured. Also, there was a virtual currency that was highly speculative and tied into the Bunz trading platform that also similarly failed. I examined those economic models closely to determine where mistakes were made. Toronto Local Currency is structured differently to ensure that it would have more stability and would not be speculative, so that consumers and retailers will feel confident and comfortable in using it.<br><br><strong>What exactly happened with these other currencies in Canada?</strong></p>\n<p>The Toronto Dollar took a commission from retailers who accepted it, and donated this commission to charity. However, losing a percentage of your revenue on each transaction adds up for a small business owner. While it is great that money went to charity, it did not actually inspire business owners to adopt the currency.</p>\n<p>We do not take any commission from our retailers and service providers who accept it. It is a way to inject liquidity into the Toronto market, help inspire more spending locally and benefit local businesses the most.</p>\n<p>The virtual currency became far too speculative. Eventually, it was just too far removed from actual value to be real. So, the value proposition and economic model collapsed because there was no Canadian money to back the virtual one.</p>\n<p>Toronto Local Currency is different in that every TLC is backed by a Canadian dollar. People can be confident that every TLC actually does stand for a Canadian dollar.</p>\n<blockquote>\n<p>TLC is a way of facilitating that cash transfer to people in need, but also adding a coolness factor for people who do not need help right now.</p>\n</blockquote>\n<p><strong>I saw that you are giving free TLC to people with lower income. How does this work and how do you fund it?</strong></p>\n<p>TLC is funded by two main buckets of money. One is through donors and the other through consumers. Certainly, some people in Toronto would want to purchase TLC because it looks great, it is a symbol of local investment and local pride, and a cool souvenir.</p>\n<p>People can buy it at an exchange rate of two to one (e.g. 20 Canadian dollars for 10 TLC). On the other hand, donors and sponsors would be donating in a regular way. Overall, TLC is a way of facilitating that cash transfer to people in need, but also adding a coolness factor for people who do not need help right now.<br><br><strong>I hope Torontonians will join you and embrace this currency!</strong></p>\n<blockquote>\n<p>I think that it is time for young women and visible minorities to have authority, influence and energy, and share our creativity.</p>\n</blockquote>\n<p><strong>Let's talk about your entrepreneurial journey. What are the biggest challenges that you have had so far?</strong></p>\n<p>Mostly, the challenges that most young women of color face: our credentials and abilities are questioned and examined much more harshly than our white male or even white female colleagues. I remember the first time I was starting a business, seven years ago. I went to the bank to get a business account and the man across the desk kept questioning me like he could not believe that a young woman of color had started a business. I don't think that would have happened to someone who had looked different than myself in that position. I think that it is time for young women and visible minorities to have authority, influence and energy, and share our creativity.<br><br><strong>How to tackle these challenges?</strong></p>\n<p>You cannot let the backwards thinking of a couple of people keep you from what you are meant to do. You look for allies, partners, strategic partnerships that are going to empower you. Not everyone is going to have confidence in you. Some people are going to question you, be prepared for that, but do not let it stand in your way because you might just have the idea for the next big thing that could do a lot of good and change a lot of people's lives for the better.<br><br><strong>Today, do you feel you have any challenges that you need help to overcome?</strong><br><br>We have had to do some strategic, large pivots. The project was supposed to have a much more exciting roll-out than is possible right now with the harsh lock-down in Ontario. As it is a physical currency, it requires people to be able to actually go into shops, restaurants and grooming services. Also, some of our partnerships, like with various Christmas markets, had to be cancelled. So, right now we have had to pivot to just expanding the network rather than getting the currency operational immediately.</p>\n<p><strong>I agree that we have to adapt and try to find other ways to make things happen.<br></strong><strong>Now, let's talk about the organisation itself. What is the status of your organisation?</strong></p>\n<p>Charitable status in Canada is actually fairly difficult to get and has quite a few restraints on what you are able to do, as well as burdensome administrative requirements. To increase our flexibility and allow this project to get off the ground early enough, we made the conscious decision to leave it as a social entrepreneurship vehicle rather than go for official charitable status.<br><br><strong>You mentioned donations earlier. Would you say you rely more on donations or people buying TLC?</strong><br><br>At this point, bearing in mind the market conditions, we rely more on donations. As the economy opens up again, I expect that will change.</p>\n<blockquote>\n<p>We are empowering people to make their own best decisions and to do it in a way that helps benefit the local economy.</p>\n</blockquote>\n<p><strong>Overall, what would you say are your biggest achievements for this project?</strong></p>\n<p>I would say that the biggest achievement is mostly the impact that we have to empower people and give them dignity. If you provide someone with groceries that are not culturally relevant, or give a single mom a bag of groceries when what she really needs are diapers, you have helped them but you have not solved their problems.</p>\n<p>Toronto Local Currency empowers people to solve the problems that are most pressing for them. We are empowering people to make their own best decisions and do it in a way that helps benefit the local economy. You have a two-fold benefit from one economic tool and I think that is really cool.<br><br><strong>What is your vision for the years to come and how do you plan to materialise it?</strong></p>\n<p>We want to scale. Hopefully, this pandemic and the recession will end and we will be unnecessary. That is the thing about development projects: your greatest hope is always to put yourself out of business.</p>\n<p>I hope that for the next few years, TLC can become a tool that is widely used in Toronto, and helps people think more about their decisions when they are buying. I hope that this is going to be a project which inspires people to buy locally and consciously.</p>\n<hr>\n<p>Thanks so much for reading this post, I hope you enjoyed it!</p>\n<p>If you are a social entrepreneur and would like to chat with me, feel free to reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>.</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/4/Toronto-2.jpeg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-01-28T19:11:46-05:00",
            "date_modified": "2021-02-11T08:12:24-05:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/a-moment-with-smart-chelis-pratiksha-pandey.html",
            "url": "https://blog.socialimpactguild.com/a-moment-with-smart-chelis-pratiksha-pandey.html",
            "title": "A Moment With Smart Cheli&#x27;s Pratiksha Pandey",
            "summary": "<p>A few days ago, I had the pleasure to meet Pratiksha Pandey, a social entrepreneur in Nepal that encourages young girls to pursue an education in STEAM (Science, Technology, Engineering, Arts and Mathematics). I was excited when I came across her organisation, <a href=\"https://www.facebook.com/smartcheli/\" target=\"_blank\" rel=\"noopener noreferrer\">Smart Cheli</a>, because I am extremely passionate about science and social entrepreneurship. So, Smart Cheli's purpose resonated with me. You can discover this incredible organisation through this short interview!</p>\n",
            "content_html": "<p>A few days ago, I had the pleasure to meet Pratiksha Pandey, a social entrepreneur in Nepal that encourages young girls to pursue an education in STEAM (Science, Technology, Engineering, Arts and Mathematics). I was excited when I came across her organisation, <a href=\"https://www.facebook.com/smartcheli/\" target=\"_blank\" rel=\"noopener noreferrer\">Smart Cheli</a>, because I am extremely passionate about science and social entrepreneurship. So, Smart Cheli's purpose resonated with me. You can discover this incredible organisation through this short interview!</p>\n<hr>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/_I5jUzqtf84?t=5s\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><strong>Could you present yourself and your organisation?</strong><br>Thank you Nadia for having me. Hi, I am Pratiksha Pandey I am from Nepal and I have been working in this field for five years. Also, I am currently working as a mentor for the <a href=\"https://www.nyas.org/programs/global-stem-alliance/1000-girls-1000-futures/\" target=\"_blank\" rel=\"noopener noreferrer\">\"1000 Girls, 1000 Futures\" program</a> for the New York Academy of Science and I am leading the organisation Smart Cheli (<em>Smart Daughter</em>) here in Nepal. Smart Cheli is an organisation that provides STEAM education to young girls. We provide STEAM workshops and mentorship. In the STEAM workshops, we involve the young girls in project-based learning in our space. During the mentorship program, we connect them with mentors based on their interests. We also provide STEAM workshops in schools as extracurricular activities.</p>\n<blockquote>\n<p>There is no gender-based subject. It's all up to you. It's all up to your interest.</p>\n</blockquote>\n<p><strong>Why did you start this organisation? What was the motivation behind it?</strong><br>When I was in college, I was doing a Bachelor in Electronics and Communications Engineering - and we were three girls. Before that, a lot of people were saying that engineering is not for girls - and that it is hard for them. But, in my classroom, we were three girls, doing the same things than boys, and getting the same marks, so it didn't make sense! That made me feel like that there is no gender-based subject. It's all up to you. It's all up to your interest. These are stereotypes that make us feel that we are less capable. So, many girls are falling behind and not joining these fields because of these stereotypes. I think that, to avoid this, we need to go back to the schools, increase awareness among young girls and make them feel they are not less capable.<br><br><strong>What have been your most exciting achievements or experiences during your social entrepreneurship journey?</strong> <br>Before Smart Cheli, I was engaged with <a href=\"https://www.wistemnepal.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Women In STEM</a> in Nepal. When I was working with that organisation, I was awarded the <a href=\"https://www.cledepeau-beaute.com/int/powerofradiance-2020.html\" target=\"_blank\" rel=\"noopener noreferrer\">Power of Radiance Award 2020</a> for the work in the field of education. That is not such a big achievement because there are so many things yet to achieve but this award recognised our work around the globe. Yes, that was the happiest moment in my life!</p>\n<blockquote>\n<p>We are human beings, we want to face people when we talk to them.</p>\n</blockquote>\n<p><strong>How did the COVID-19 pandemic impact your organisation?</strong><br>Yes, COVID has had an impact because some of the schools are opening, but many are still closed. So, we are not going back to the schools and now, we are just doing virtual sessions for girls. We are not able to bring them in our space and watch their performance by ourselves. It makes everything more monotonous. We are human beings, we want to face people when we talk to them. The pandemic make things a little bit complicated, but it will pass and things will go back to the way they were before.<br><br><strong>Prior to COVID-19, what other challenges have you faced as a social entrepreneur? </strong><br>Before the pandemic, we were planning to reach out to programs in other districts in Nepal and reach out to more girls that do not have access to STEAM education. These plans are postponed for now, but we will resume them after the situation becomes normal again.<br><br><strong>What is your vision for the years to come? Also, do you generate revenues to sustain your purpose or do you rely solely on donations and government grants?</strong><br>Currently, we are sustained by grants and we are also planning to be self-sustained. It is not possible to be entirely self-sustained but we are planning to generate some revenues, from our workshops for instance, that will help us in some way. We are also looking to collaborate with local government to reach more people, and seeking other grants or applying for not-for-profit organisation programs. We are trying to make everything more effective and sustainable.<br><br><strong>How would you define a social enterprise?</strong><br>Yes, there are lots of definitions for it. And also, they can be different in different countries. At first, I was thinking that a social enterprise is an enterprise that serves society in some way and takes money from it, which will help grow the organisation. However, in Nepal, that definition is slightly wrong because here a social enterprise is just a company which uses grants and cannot make profit. It's not a profit-making company but we can use revenues to organise and manage our office.</p>\n<blockquote>\n<p>Let's spread positivity and inspire more people around the world!</p>\n</blockquote>\n<p><strong>Would like to share anything else with the people who are going to see this interview?</strong><br>Let's spread positivity and inspire more people around the world!</p>\n<hr>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/What-is-STEM.png\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/What-is-STEM-thumbnail.png\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/girls.jpg\" data-size=\"2048x1365\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/girls-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom.JPG\" data-size=\"5184x3456\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom-thumbnail.JPG\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom-2.JPG\" data-size=\"5184x3456\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/classroom-2-thumbnail.JPG\" alt=\"\" width=\"720\" height=\"480\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-1.png\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-1-thumbnail.png\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-2.png\" data-size=\"960x960\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/testimonial-2-thumbnail.png\" alt=\"\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/workshop.jpg\" data-size=\"2048x1448\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/workshop-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"509\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://blog.socialimpactguild.com/media/posts/3/gallery/virtual-session.jpg\" data-size=\"1920x905\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/3/gallery/virtual-session-thumbnail.jpg\" alt=\"\" width=\"720\" height=\"339\"></a></figure>\n</div></div>\n<p>Thanks so much for reading this post, I hope you enjoyed it! You can find Smart Cheli on <a href=\"https://www.facebook.com/smartcheli/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a>, <a href=\"https://www.instagram.com/smartcheli/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a> and <a href=\"https://www.linkedin.com/company/smart-cheli/\" target=\"_blank\" rel=\"noopener\">LinkedIn</a>.</p>\n<p>If you are a social entrepreneur and would like to chat with me, feel free to reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz/\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a>!</p>",
            "image": "https://blog.socialimpactguild.com/media/posts/3/girls-2.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Interview"
            ],
            "date_published": "2021-01-18T12:28:00-05:00",
            "date_modified": "2021-02-12T21:17:59-05:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/what-is-a-social-entrepreneur.html",
            "url": "https://blog.socialimpactguild.com/what-is-a-social-entrepreneur.html",
            "title": "What is a Social Entrepreneur?",
            "summary": "<p>Nowadays, several definitions of social entrepreneurship coexist. \nI think this ambiguity might sometimes dilute social entrepreneurs’ image, reduce their credibility vis-a-vis other entrepreneurs, weaken the relevance of the insights they receive and, ultimately, harm their purpose. Therefore, having a shared understanding of what social entrepreneurship means seems essential.</p>\n",
            "content_html": "<p>Nowadays, several definitions of social entrepreneurship coexist. \nI think this ambiguity might sometimes dilute social entrepreneurs’ image, reduce their credibility vis-a-vis other entrepreneurs, weaken the relevance of the insights they receive and, ultimately, harm their purpose. Therefore, having a shared understanding of what social entrepreneurship means seems essential.</p>\n<hr id=\"read-more\" />\n\n<h2 id=\"a-social-entrepreneurship-definition\">A Social Entrepreneurship Definition</h2>\n<p>From my point of view, a social entrepreneur is an entrepreneur whose decisions are <strong>primarily</strong> driven towards effecting lasting, large-scale social benefits. This definition covers a specific section of the <a href=\"https://www.researchgate.net/figure/A-social-enterprise-hybrid-spectrum-as-constructed-by-Kim-Alter-2007-p14_fig1_304624327\">social-business hybrid spectrum</a>, including non-profit organizations that leverage <strong>business tools</strong> to achieve sustainability and pursue their social mission at scale. However, it excludes corporations practicing social responsibility as social impact is not their primary focus.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://blog.socialimpactguild.com/media/posts/2/Social-Business-Hybrid-Spectrum.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://blog.socialimpactguild.com/media/posts/2/responsive/Social-Business-Hybrid-Spectrum-xs.png 300w ,https://blog.socialimpactguild.com/media/posts/2/responsive/Social-Business-Hybrid-Spectrum-sm.png 480w ,https://blog.socialimpactguild.com/media/posts/2/responsive/Social-Business-Hybrid-Spectrum-md.png 768w\"  alt=\"Image description\" width=\"1436\" height=\"408\" /></figure></p>\n<h2 id=\"some-insights-regarding-social-entrepreneurs\">Some Insights Regarding Social Entrepreneurs</h2>\n<p>After meeting with social entrepreneurs from various industries and backgrounds, I noticed that their similarities outweight their differences by an order of magnitude.</p>\n<p>First, they have all developed a social fibre through experiences that have changed their understanding of the world. This evolution led them to solve problems they witnessed or suffered themselves, usually by leveraging their passions or previous knowledge.</p>\n<p>The social entrepreneurs I have met are also extremely action-oriented and lean towards a trial-and-error approach to problem-solving, as they are uncomfortable with the status quo and feel the urgency to break it.</p>\n<p>However, they are down-to-earth and want to effect social impact while generating benefits for themselves as well. These benefits can sometimes take a cathartic form: by preventing others from suffering, they relieve their own pain.</p>\n<p>My discussions also underlined that social entrepreneurs are resilient and believe they have (or can find) the skills to tackle the obstacles standing in their path. Nervertheless, this observation might be an instance of survivorship bias. Indeed, less optimistic people might have given up during the early stages of their journey and I would not have had the chance to meet them. Otherwise, being overly optimistic can sometimes be the only path to succeed - as Mark Twain put it, <em>“they did not know it was impossible, so they did it”</em>.</p>\n<p>Interestingly, despite their optimism and urge to act, social entrepreneurs I have met are not risk-takers. They started their venture with small investments, and a home-made <em>do-it-yourself</em> approach. My chats revealed that this risk aversion can sometimes generate challenges when comes the time to advance to a higher-stake stage.</p>\n<p>Finally, I find that social entrepreneurs I know are particularly open to new ideas and insights. Nonetheless, this inference may be biased as they are all people willing to chat!</p>\n<h2 id=\"thank-you\">Thank you</h2>\n<p>Thanks so much for reading this post, I hope you enjoyed it! </p>\n<p>Feel free to reach out to me via <a href=\"https://www.linkedin.com/in/nadia-humbert-labeaumaz/\">LinkedIn</a> anytime.</p>\n",
            "image": "https://blog.socialimpactguild.com/media/posts/2/dictionary-1619740_1920.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Social Entrepreneurship"
            ],
            "date_published": "2021-01-14T19:03:32-05:00",
            "date_modified": "2021-02-11T08:26:30-05:00"
        },
        {
            "id": "https://blog.socialimpactguild.com/origin-story.html",
            "url": "https://blog.socialimpactguild.com/origin-story.html",
            "title": "Origin Story",
            "summary": "<p>Hi, my name is Nadia.</p>\n<p>I was borned in Central America, worked towards going to France to have better opportunities in life and did it at 17 years-old by myself. Since then, I have travelled the world to live, study varied subjects and work. </p>\n",
            "content_html": "<p>Hi, my name is Nadia.</p>\n<p>I was borned in Central America, worked towards going to France to have better opportunities in life and did it at 17 years-old by myself. Since then, I have travelled the world to live, study varied subjects and work. </p>\n<hr id=\"read-more\" />\n\n<p>Inspired by the life of my incredible grand-father, who dedicated his entire life to helping others, I decided to focus my work towards effecting positive social outcomes. I want to create as many projects as possible to help people and their communities. Recently, I completed an MBA to increase my chances of achieving this goal. </p>\n<p>Now, one of my endeavours is to create a support system for social entrepreneurs. Indeed, I had the chance to meet with some of them during my journey and they were all extremely passionate about generating lasting, large-scale social benefits. So, I felt an immediate strong connection with them. </p>\n<p>Since they all shared challenges and drivers, I decided I would do something to help them, ignite the same spark amongst other people and leverage our common knowledge to support each other and our communities.</p>\n<p>The Social Impact Guild aims to help social entrepreneurs gain visibility and leverage their cumulative experience to face their day-to-day challenges. It would also provide a safe space where social entrepreneurs can share their feelings and stories. If you are a social entrepreneur or someone who wants to enable social impact, you can express your interest by completing this short survey (2-3 mins): <a href=\"https://socialimpactguild.com/survey\">https://socialimpactguild.com/survey</a>  </p>\n<p>Thank you for reading this post. I am looking forward to connecting with you soon!</p>\n",
            "image": "https://blog.socialimpactguild.com/media/posts/1/origin-story-plant.jpg",
            "author": {
                "name": "Nadia Humbert-Labeaumaz"
            },
            "tags": [
                   "Social Entrepreneurship",
                   "Editor Pick&#x27;s"
            ],
            "date_published": "2021-01-05T19:02:00-05:00",
            "date_modified": "2021-02-11T08:25:50-05:00"
        }
    ]
}
